podonoghue/usbdm-firmware/BootloopMKE/Project_Headers/MKE02Z64M4.h
#define ACMP0_CS                       (ACMP0->CS)
#define ACMP0_C0                       (ACMP0->C0)
#define ACMP0_C1                       (ACMP0->C1)
#define ACMP0_C2                       (ACMP0->C2)

/* ================================================================================ */
/* ================           ACMP1 (derived from ACMP0)           ================ */
/* ================================================================================ */

/**
 * @brief Analog comparator
 */
typedef ACMP0_Type ACMP1_Type;  /*!< ACMP1 Structure                                             */


/* -------------------------------------------------------------------------------- */
/* -----------     'ACMP1' Register Access macros                       ----------- */
/* -------------------------------------------------------------------------------- */

#define ACMP1_CS                       (ACMP1->CS)
#define ACMP1_C0                       (ACMP1->C0)
#define ACMP1_C1                       (ACMP1->C1)
#define ACMP1_C2                       (ACMP1->C2)

/* ================================================================================ */
/* ================           ADC (file:ADC_MKE02)                 ================ */
/* ================================================================================ */

/**
 * @brief Analog-to-digital converter
 */
typedef struct {                                /*!<       ADC Structure                                                */
   __IO uint32_t  SC1;                          /*!< 0000: Status and Control Register 1                                */
   __IO uint32_t  SC2;                          /*!< 0004: Status and Control Register 2                                */
   __IO uint32_t  SC3;                          /*!< 0008: Status and Control Register 3                                */
   __IO uint32_t  SC4;                          /*!< 000C: Status and Control Register 4                                */
   __I  uint32_t  R;                            /*!< 0010: Conversion Result Register                                   */
   __IO uint32_t  CV;                           /*!< 0014: Compare Value Register                                       */
   __IO uint32_t  APCTL1;                       /*!< 0018: Pin Control 1 Register                                       */
} ADC_Type;


/* -------------------------------------------------------------------------------- */
/* -----------     'ADC' Position & Mask macros                         ----------- */
/* -------------------------------------------------------------------------------- */


/* ------- ADC_SC1                                  ------ */
#define ADC_SC1_ADCH_MASK                        (0x1FUL << ADC_SC1_ADCH_SHIFT)                      /*!< ADC_SC1: ADCH Mask                      */
#define ADC_SC1_ADCH_SHIFT                       0                                                   /*!< ADC_SC1: ADCH Position                  */
#define ADC_SC1_ADCH(x)                          (((x)<<ADC_SC1_ADCH_SHIFT)&ADC_SC1_ADCH_MASK)       /*!< ADC_SC1                                 */
#define ADC_SC1_ADCO_MASK                        (0x01UL << ADC_SC1_ADCO_SHIFT)                      /*!< ADC_SC1: ADCO Mask                      */
#define ADC_SC1_ADCO_SHIFT                       5                                                   /*!< ADC_SC1: ADCO Position                  */
#define ADC_SC1_AIEN_MASK                        (0x01UL << ADC_SC1_AIEN_SHIFT)                      /*!< ADC_SC1: AIEN Mask                      */
#define ADC_SC1_AIEN_SHIFT                       6                                                   /*!< ADC_SC1: AIEN Position                  */
#define ADC_SC1_COCO_MASK                        (0x01UL << ADC_SC1_COCO_SHIFT)                      /*!< ADC_SC1: COCO Mask                      */
#define ADC_SC1_COCO_SHIFT                       7                                                   /*!< ADC_SC1: COCO Position                  */

/* ------- ADC_SC2                                  ------ */
#define ADC_SC2_REFSEL_MASK                      (0x03UL << ADC_SC2_REFSEL_SHIFT)                    /*!< ADC_SC2: REFSEL Mask                    */
#define ADC_SC2_REFSEL_SHIFT                     0                                                   /*!< ADC_SC2: REFSEL Position                */
#define ADC_SC2_REFSEL(x)                        (((x)<<ADC_SC2_REFSEL_SHIFT)&ADC_SC2_REFSEL_MASK)   /*!< ADC_SC2                                 */
#define ADC_SC2_FFULL_MASK                       (0x01UL << ADC_SC2_FFULL_SHIFT)                     /*!< ADC_SC2: FFULL Mask                     */
#define ADC_SC2_FFULL_SHIFT                      2                                                   /*!< ADC_SC2: FFULL Position                 */
#define ADC_SC2_FEMPTY_MASK                      (0x01UL << ADC_SC2_FEMPTY_SHIFT)                    /*!< ADC_SC2: FEMPTY Mask                    */
#define ADC_SC2_FEMPTY_SHIFT                     3                                                   /*!< ADC_SC2: FEMPTY Position                */
#define ADC_SC2_ACFGT_MASK                       (0x01UL << ADC_SC2_ACFGT_SHIFT)                     /*!< ADC_SC2: ACFGT Mask                     */
#define ADC_SC2_ACFGT_SHIFT                      4                                                   /*!< ADC_SC2: ACFGT Position                 */
#define ADC_SC2_ACFE_MASK                        (0x01UL << ADC_SC2_ACFE_SHIFT)                      /*!< ADC_SC2: ACFE Mask                      */
#define ADC_SC2_ACFE_SHIFT                       5                                                   /*!< ADC_SC2: ACFE Position                  */
#define ADC_SC2_ADTRG_MASK                       (0x01UL << ADC_SC2_ADTRG_SHIFT)                     /*!< ADC_SC2: ADTRG Mask                     */
#define ADC_SC2_ADTRG_SHIFT                      6                                                   /*!< ADC_SC2: ADTRG Position                 */
#define ADC_SC2_ADACT_MASK                       (0x01UL << ADC_SC2_ADACT_SHIFT)                     /*!< ADC_SC2: ADACT Mask                     */
#define ADC_SC2_ADACT_SHIFT                      7                                                   /*!< ADC_SC2: ADACT Position                 */

/* ------- ADC_SC3                                  ------ */
#define ADC_SC3_ADICLK_MASK                      (0x03UL << ADC_SC3_ADICLK_SHIFT)                    /*!< ADC_SC3: ADICLK Mask                    */
#define ADC_SC3_ADICLK_SHIFT                     0                                                   /*!< ADC_SC3: ADICLK Position                */
#define ADC_SC3_ADICLK(x)                        (((x)<<ADC_SC3_ADICLK_SHIFT)&ADC_SC3_ADICLK_MASK)   /*!< ADC_SC3                                 */
#define ADC_SC3_MODE_MASK                        (0x03UL << ADC_SC3_MODE_SHIFT)                      /*!< ADC_SC3: MODE Mask                      */
#define ADC_SC3_MODE_SHIFT                       2                                                   /*!< ADC_SC3: MODE Position                  */
#define ADC_SC3_MODE(x)                          (((x)<<ADC_SC3_MODE_SHIFT)&ADC_SC3_MODE_MASK)       /*!< ADC_SC3                                 */
#define ADC_SC3_ADLSMP_MASK                      (0x01UL << ADC_SC3_ADLSMP_SHIFT)                    /*!< ADC_SC3: ADLSMP Mask                    */
#define ADC_SC3_ADLSMP_SHIFT                     4                                                   /*!< ADC_SC3: ADLSMP Position                */
#define ADC_SC3_ADIV_MASK                        (0x03UL << ADC_SC3_ADIV_SHIFT)                      /*!< ADC_SC3: ADIV Mask                      */
#define ADC_SC3_ADIV_SHIFT                       5                                                   /*!< ADC_SC3: ADIV Position                  */
#define ADC_SC3_ADIV(x)                          (((x)<<ADC_SC3_ADIV_SHIFT)&ADC_SC3_ADIV_MASK)       /*!< ADC_SC3                                 */
#define ADC_SC3_ADLPC_MASK                       (0x01UL << ADC_SC3_ADLPC_SHIFT)                     /*!< ADC_SC3: ADLPC Mask                     */
#define ADC_SC3_ADLPC_SHIFT                      7                                                   /*!< ADC_SC3: ADLPC Position                 */

