podonoghue/usbdm-firmware/BootloopMKE/Project_Headers/MKE02Z64M4.h
/* ------- ADC_SC4                                  ------ */
#define ADC_SC4_AFDEP_MASK                       (0x07UL << ADC_SC4_AFDEP_SHIFT)                     /*!< ADC_SC4: AFDEP Mask                     */
#define ADC_SC4_AFDEP_SHIFT                      0                                                   /*!< ADC_SC4: AFDEP Position                 */
#define ADC_SC4_AFDEP(x)                         (((x)<<ADC_SC4_AFDEP_SHIFT)&ADC_SC4_AFDEP_MASK)     /*!< ADC_SC4                                 */
#define ADC_SC4_ACFSEL_MASK                      (0x01UL << ADC_SC4_ACFSEL_SHIFT)                    /*!< ADC_SC4: ACFSEL Mask                    */
#define ADC_SC4_ACFSEL_SHIFT                     5                                                   /*!< ADC_SC4: ACFSEL Position                */
#define ADC_SC4_ASCANE_MASK                      (0x01UL << ADC_SC4_ASCANE_SHIFT)                    /*!< ADC_SC4: ASCANE Mask                    */
#define ADC_SC4_ASCANE_SHIFT                     6                                                   /*!< ADC_SC4: ASCANE Position                */

/* ------- ADC_R                                    ------ */
#define ADC_R_ADR_MASK                           (0xFFFUL << ADC_R_ADR_SHIFT)                        /*!< ADC_R: ADR Mask                         */
#define ADC_R_ADR_SHIFT                          0                                                   /*!< ADC_R: ADR Position                     */
#define ADC_R_ADR(x)                             (((x)<<ADC_R_ADR_SHIFT)&ADC_R_ADR_MASK)             /*!< ADC_R                                   */

/* ------- ADC_CV                                   ------ */
#define ADC_CV_ADR_MASK                          (0xFFFUL << ADC_CV_ADR_SHIFT)                       /*!< ADC_CV: ADR Mask                        */
#define ADC_CV_ADR_SHIFT                         0                                                   /*!< ADC_CV: ADR Position                    */
#define ADC_CV_ADR(x)                            (((x)<<ADC_CV_ADR_SHIFT)&ADC_CV_ADR_MASK)           /*!< ADC_CV                                  */

/* ------- ADC_APCTL1                               ------ */
#define ADC_APCTL1_ADPC_MASK                     (0xFFFFUL << ADC_APCTL1_ADPC_SHIFT)                 /*!< ADC_APCTL1: ADPC Mask                   */
#define ADC_APCTL1_ADPC_SHIFT                    0                                                   /*!< ADC_APCTL1: ADPC Position               */
#define ADC_APCTL1_ADPC(x)                       (((x)<<ADC_APCTL1_ADPC_SHIFT)&ADC_APCTL1_ADPC_MASK) /*!< ADC_APCTL1                              */

/* -------------------------------------------------------------------------------- */
/* -----------     'ADC' Register Access macros                         ----------- */
/* -------------------------------------------------------------------------------- */

#define ADC_SC1                        (ADC->SC1)
#define ADC_SC2                        (ADC->SC2)
#define ADC_SC3                        (ADC->SC3)
#define ADC_SC4                        (ADC->SC4)
#define ADC_R                          (ADC->R)
#define ADC_CV                         (ADC->CV)
#define ADC_APCTL1                     (ADC->APCTL1)

/* ================================================================================ */
/* ================           BP (file:BP_1_MKE)                   ================ */
/* ================================================================================ */

/**
 * @brief Breakpoint Unit
 */
typedef struct {                                /*!<       BP Structure                                                 */
   __IO uint32_t  CTRL;                         /*!< 0000:                                                              */
   __I  uint32_t  RESERVED0;                    /*!< 0004:                                                              */
   __IO uint32_t  COMP[2];                      /*!< 0008:                                                              */
   __I  uint32_t  RESERVED1[1008];              /*!< 0010:                                                              */
   __IO uint32_t  PID4;                         /*!< 0FD0:                                                              */
   __IO uint32_t  PID5;                         /*!< 0FD4:                                                              */
   __IO uint32_t  PID6;                         /*!< 0FD8:                                                              */
   __IO uint32_t  PID7;                         /*!< 0FDC:                                                              */
   __IO uint32_t  PID0;                         /*!< 0FE0:                                                              */
   __IO uint32_t  PID1;                         /*!< 0FE4:                                                              */
   __IO uint32_t  PID2;                         /*!< 0FE8:                                                              */
   __IO uint32_t  PID3;                         /*!< 0FEC:                                                              */
   __IO uint32_t  CID[4];                       /*!< 0FF0:                                                              */
} BP_Type;


/* -------------------------------------------------------------------------------- */
/* -----------     'BP' Position & Mask macros                          ----------- */
/* -------------------------------------------------------------------------------- */


/* ------- BP_CTRL                                  ------ */

/* ------- BP_COMP                                  ------ */

/* ------- BP_PID                                   ------ */

/* ------- BP_CID                                   ------ */

/* -------------------------------------------------------------------------------- */
/* -----------     'BP' Register Access macros                          ----------- */
/* -------------------------------------------------------------------------------- */

#define BP_CTRL                        (BP->CTRL)
#define BP_COMP0                       (BP->COMP[0])
#define BP_COMP1                       (BP->COMP[1])
#define BP_PID4                        (BP->PID4)
#define BP_PID5                        (BP->PID5)
#define BP_PID6                        (BP->PID6)
#define BP_PID7                        (BP->PID7)
#define BP_PID0                        (BP->PID0)
#define BP_PID1                        (BP->PID1)
#define BP_PID2                        (BP->PID2)
#define BP_PID3                        (BP->PID3)
#define BP_CID0                        (BP->CID[0])
#define BP_CID1                        (BP->CID[1])
#define BP_CID2                        (BP->CID[2])
#define BP_CID3                        (BP->CID[3])

/* ================================================================================ */
/* ================           CRC (file:CRC)                       ================ */
/* ================================================================================ */

/**
 * @brief Cyclic Redundancy Check
 */
typedef struct {                                /*!<       CRC Structure                                                */
   union {                                      /*!< 0000: (size=0004)                                                  */
      __IO uint32_t  DATA;                      /*!< 0000: Data register                                                */
      struct {                                  /*!< 0000: (size=0004)                                                  */
         union {                                /*!< 0000: (size=0002)                                                  */
            __IO uint16_t  DATAL;               /*!< 0000: DATAL register                                               */
            struct {                            /*!< 0000: (size=0002)                                                  */
               __IO uint8_t   DATALL;           /*!< 0000: DATALL register                                              */
               __IO uint8_t   DATALU;           /*!< 0001: DATALU register                                              */
            };
         };
         union {                                /*!< 0000: (size=0002)                                                  */
            __IO uint16_t  DATAH;               /*!< 0002: DATAH register                                               */
            struct {                            /*!< 0000: (size=0002)                                                  */
               __IO uint8_t   DATAHL;           /*!< 0002: DATAHL register                                              */
               __IO uint8_t   DATAHU;           /*!< 0003: DATAHU register                                              */
            };
         };
      };
   };
   union {                                      /*!< 0000: (size=0004)                                                  */
      __IO uint32_t  GPOLY;                     /*!< 0004: Polynomial register                                          */
      struct {                                  /*!< 0000: (size=0004)                                                  */
         union {                                /*!< 0000: (size=0002)                                                  */
            __IO uint16_t  GPOLYL;              /*!< 0004: GPOLYL register                                              */
            struct {                            /*!< 0000: (size=0002)                                                  */
               __IO uint8_t   GPOLYLL;          /*!< 0004: GPOLYLL register                                             */
               __IO uint8_t   GPOLYLU;          /*!< 0005: GPOLYLU register                                             */
            };
         };
         union {                                /*!< 0000: (size=0002)                                                  */
            __IO uint16_t  GPOLYH;              /*!< 0006: GPOLYH register                                              */
            struct {                            /*!< 0000: (size=0002)                                                  */
               __IO uint8_t   GPOLYHL;          /*!< 0006: GPOLYHL register                                             */
               __IO uint8_t   GPOLYHU;          /*!< 0007: GPOLYHU register                                             */
            };
         };
      };
   };
   union {                                      /*!< 0000: (size=0004)                                                  */
      __IO uint32_t  CTRL;                      /*!< 0008: Control register                                             */
      struct {                                  /*!< 0000: (size=0004)                                                  */
         __I  uint8_t   RESERVED0[3];           /*!< 0008:                                                              */
         __IO uint8_t   CTRLHU;                 /*!< 000B: Control register (byte access)                               */
      };
   };
} CRC_Type;


/* -------------------------------------------------------------------------------- */
/* -----------     'CRC' Position & Mask macros                         ----------- */
/* -------------------------------------------------------------------------------- */


/* ------- CRC_DATA                                 ------ */
#define CRC_DATA_LL_MASK                         (0xFFUL << CRC_DATA_LL_SHIFT)                       /*!< CRC_DATA: LL Mask                       */
#define CRC_DATA_LL_SHIFT                        0                                                   /*!< CRC_DATA: LL Position                   */
#define CRC_DATA_LL(x)                           (((x)<<CRC_DATA_LL_SHIFT)&CRC_DATA_LL_MASK)         /*!< CRC_DATA                                */
#define CRC_DATA_LU_MASK                         (0xFFUL << CRC_DATA_LU_SHIFT)                       /*!< CRC_DATA: LU Mask                       */
#define CRC_DATA_LU_SHIFT                        8                                                   /*!< CRC_DATA: LU Position                   */
#define CRC_DATA_LU(x)                           (((x)<<CRC_DATA_LU_SHIFT)&CRC_DATA_LU_MASK)         /*!< CRC_DATA                                */
#define CRC_DATA_HL_MASK                         (0xFFUL << CRC_DATA_HL_SHIFT)                       /*!< CRC_DATA: HL Mask                       */
#define CRC_DATA_HL_SHIFT                        16                                                  /*!< CRC_DATA: HL Position                   */
#define CRC_DATA_HL(x)                           (((x)<<CRC_DATA_HL_SHIFT)&CRC_DATA_HL_MASK)         /*!< CRC_DATA                                */
#define CRC_DATA_HU_MASK                         (0xFFUL << CRC_DATA_HU_SHIFT)                       /*!< CRC_DATA: HU Mask                       */
#define CRC_DATA_HU_SHIFT                        24                                                  /*!< CRC_DATA: HU Position                   */
#define CRC_DATA_HU(x)                           (((x)<<CRC_DATA_HU_SHIFT)&CRC_DATA_HU_MASK)         /*!< CRC_DATA                                */

/* ------- CRC_DATAL                                ------ */
#define CRC_DATAL_DATAL_MASK                     (0xFFFFUL << CRC_DATAL_DATAL_SHIFT)                 /*!< CRC_DATAL: DATAL Mask                   */
#define CRC_DATAL_DATAL_SHIFT                    0                                                   /*!< CRC_DATAL: DATAL Position               */
#define CRC_DATAL_DATAL(x)                       (((x)<<CRC_DATAL_DATAL_SHIFT)&CRC_DATAL_DATAL_MASK) /*!< CRC_DATAL                               */

