podonoghue/usbdm-firmware/BootloopMKE/Project_Headers/MKE02Z64M4.h
/* ------- CRC_DATALL                               ------ */
#define CRC_DATALL_DATALL_MASK                   (0xFFUL << CRC_DATALL_DATALL_SHIFT)                 /*!< CRC_DATALL: DATALL Mask                 */
#define CRC_DATALL_DATALL_SHIFT                  0                                                   /*!< CRC_DATALL: DATALL Position             */
#define CRC_DATALL_DATALL(x)                     (((x)<<CRC_DATALL_DATALL_SHIFT)&CRC_DATALL_DATALL_MASK) /*!< CRC_DATALL                              */

/* ------- CRC_DATALU                               ------ */
#define CRC_DATALU_DATALU_MASK                   (0xFFUL << CRC_DATALU_DATALU_SHIFT)                 /*!< CRC_DATALU: DATALU Mask                 */
#define CRC_DATALU_DATALU_SHIFT                  0                                                   /*!< CRC_DATALU: DATALU Position             */
#define CRC_DATALU_DATALU(x)                     (((x)<<CRC_DATALU_DATALU_SHIFT)&CRC_DATALU_DATALU_MASK) /*!< CRC_DATALU                              */

/* ------- CRC_DATAH                                ------ */
#define CRC_DATAH_DATAH_MASK                     (0xFFFFUL << CRC_DATAH_DATAH_SHIFT)                 /*!< CRC_DATAH: DATAH Mask                   */
#define CRC_DATAH_DATAH_SHIFT                    0                                                   /*!< CRC_DATAH: DATAH Position               */
#define CRC_DATAH_DATAH(x)                       (((x)<<CRC_DATAH_DATAH_SHIFT)&CRC_DATAH_DATAH_MASK) /*!< CRC_DATAH                               */

/* ------- CRC_DATAHL                               ------ */
#define CRC_DATAHL_DATAHL_MASK                   (0xFFUL << CRC_DATAHL_DATAHL_SHIFT)                 /*!< CRC_DATAHL: DATAHL Mask                 */
#define CRC_DATAHL_DATAHL_SHIFT                  0                                                   /*!< CRC_DATAHL: DATAHL Position             */
#define CRC_DATAHL_DATAHL(x)                     (((x)<<CRC_DATAHL_DATAHL_SHIFT)&CRC_DATAHL_DATAHL_MASK) /*!< CRC_DATAHL                              */

/* ------- CRC_DATAHU                               ------ */
#define CRC_DATAHU_DATAHU_MASK                   (0xFFUL << CRC_DATAHU_DATAHU_SHIFT)                 /*!< CRC_DATAHU: DATAHU Mask                 */
#define CRC_DATAHU_DATAHU_SHIFT                  0                                                   /*!< CRC_DATAHU: DATAHU Position             */
#define CRC_DATAHU_DATAHU(x)                     (((x)<<CRC_DATAHU_DATAHU_SHIFT)&CRC_DATAHU_DATAHU_MASK) /*!< CRC_DATAHU                              */

/* ------- CRC_GPOLY                                ------ */
#define CRC_GPOLY_LOW_MASK                       (0xFFFFUL << CRC_GPOLY_LOW_SHIFT)                   /*!< CRC_GPOLY: LOW Mask                     */
#define CRC_GPOLY_LOW_SHIFT                      0                                                   /*!< CRC_GPOLY: LOW Position                 */
#define CRC_GPOLY_LOW(x)                         (((x)<<CRC_GPOLY_LOW_SHIFT)&CRC_GPOLY_LOW_MASK)     /*!< CRC_GPOLY                               */
#define CRC_GPOLY_HIGH_MASK                      (0xFFFFUL << CRC_GPOLY_HIGH_SHIFT)                  /*!< CRC_GPOLY: HIGH Mask                    */
#define CRC_GPOLY_HIGH_SHIFT                     16                                                  /*!< CRC_GPOLY: HIGH Position                */
#define CRC_GPOLY_HIGH(x)                        (((x)<<CRC_GPOLY_HIGH_SHIFT)&CRC_GPOLY_HIGH_MASK)   /*!< CRC_GPOLY                               */

/* ------- CRC_GPOLYL                               ------ */
#define CRC_GPOLYL_GPOLYL_MASK                   (0xFFFFUL << CRC_GPOLYL_GPOLYL_SHIFT)               /*!< CRC_GPOLYL: GPOLYL Mask                 */
#define CRC_GPOLYL_GPOLYL_SHIFT                  0                                                   /*!< CRC_GPOLYL: GPOLYL Position             */
#define CRC_GPOLYL_GPOLYL(x)                     (((x)<<CRC_GPOLYL_GPOLYL_SHIFT)&CRC_GPOLYL_GPOLYL_MASK) /*!< CRC_GPOLYL                              */

/* ------- CRC_GPOLYLL                              ------ */
#define CRC_GPOLYLL_GPOLYLL_MASK                 (0xFFUL << CRC_GPOLYLL_GPOLYLL_SHIFT)               /*!< CRC_GPOLYLL: GPOLYLL Mask               */
#define CRC_GPOLYLL_GPOLYLL_SHIFT                0                                                   /*!< CRC_GPOLYLL: GPOLYLL Position           */
#define CRC_GPOLYLL_GPOLYLL(x)                   (((x)<<CRC_GPOLYLL_GPOLYLL_SHIFT)&CRC_GPOLYLL_GPOLYLL_MASK) /*!< CRC_GPOLYLL                             */

/* ------- CRC_GPOLYLU                              ------ */
#define CRC_GPOLYLU_GPOLYLU_MASK                 (0xFFUL << CRC_GPOLYLU_GPOLYLU_SHIFT)               /*!< CRC_GPOLYLU: GPOLYLU Mask               */
#define CRC_GPOLYLU_GPOLYLU_SHIFT                0                                                   /*!< CRC_GPOLYLU: GPOLYLU Position           */
#define CRC_GPOLYLU_GPOLYLU(x)                   (((x)<<CRC_GPOLYLU_GPOLYLU_SHIFT)&CRC_GPOLYLU_GPOLYLU_MASK) /*!< CRC_GPOLYLU                             */

/* ------- CRC_GPOLYH                               ------ */
#define CRC_GPOLYH_GPOLYH_MASK                   (0xFFFFUL << CRC_GPOLYH_GPOLYH_SHIFT)               /*!< CRC_GPOLYH: GPOLYH Mask                 */
#define CRC_GPOLYH_GPOLYH_SHIFT                  0                                                   /*!< CRC_GPOLYH: GPOLYH Position             */
#define CRC_GPOLYH_GPOLYH(x)                     (((x)<<CRC_GPOLYH_GPOLYH_SHIFT)&CRC_GPOLYH_GPOLYH_MASK) /*!< CRC_GPOLYH                              */

/* ------- CRC_GPOLYHL                              ------ */
#define CRC_GPOLYHL_GPOLYHL_MASK                 (0xFFUL << CRC_GPOLYHL_GPOLYHL_SHIFT)               /*!< CRC_GPOLYHL: GPOLYHL Mask               */
#define CRC_GPOLYHL_GPOLYHL_SHIFT                0                                                   /*!< CRC_GPOLYHL: GPOLYHL Position           */
#define CRC_GPOLYHL_GPOLYHL(x)                   (((x)<<CRC_GPOLYHL_GPOLYHL_SHIFT)&CRC_GPOLYHL_GPOLYHL_MASK) /*!< CRC_GPOLYHL                             */

/* ------- CRC_GPOLYHU                              ------ */
#define CRC_GPOLYHU_GPOLYHU_MASK                 (0xFFUL << CRC_GPOLYHU_GPOLYHU_SHIFT)               /*!< CRC_GPOLYHU: GPOLYHU Mask               */
#define CRC_GPOLYHU_GPOLYHU_SHIFT                0                                                   /*!< CRC_GPOLYHU: GPOLYHU Position           */
#define CRC_GPOLYHU_GPOLYHU(x)                   (((x)<<CRC_GPOLYHU_GPOLYHU_SHIFT)&CRC_GPOLYHU_GPOLYHU_MASK) /*!< CRC_GPOLYHU                             */

/* ------- CRC_CTRL                                 ------ */
#define CRC_CTRL_TCRC_MASK                       (0x01UL << CRC_CTRL_TCRC_SHIFT)                     /*!< CRC_CTRL: TCRC Mask                     */
#define CRC_CTRL_TCRC_SHIFT                      24                                                  /*!< CRC_CTRL: TCRC Position                 */
#define CRC_CTRL_WAS_MASK                        (0x01UL << CRC_CTRL_WAS_SHIFT)                      /*!< CRC_CTRL: WAS Mask                      */
#define CRC_CTRL_WAS_SHIFT                       25                                                  /*!< CRC_CTRL: WAS Position                  */
#define CRC_CTRL_FXOR_MASK                       (0x01UL << CRC_CTRL_FXOR_SHIFT)                     /*!< CRC_CTRL: FXOR Mask                     */
#define CRC_CTRL_FXOR_SHIFT                      26                                                  /*!< CRC_CTRL: FXOR Position                 */
#define CRC_CTRL_TOTR_MASK                       (0x03UL << CRC_CTRL_TOTR_SHIFT)                     /*!< CRC_CTRL: TOTR Mask                     */
#define CRC_CTRL_TOTR_SHIFT                      28                                                  /*!< CRC_CTRL: TOTR Position                 */
#define CRC_CTRL_TOTR(x)                         (((x)<<CRC_CTRL_TOTR_SHIFT)&CRC_CTRL_TOTR_MASK)     /*!< CRC_CTRL                                */
#define CRC_CTRL_TOT_MASK                        (0x03UL << CRC_CTRL_TOT_SHIFT)                      /*!< CRC_CTRL: TOT Mask                      */
#define CRC_CTRL_TOT_SHIFT                       30                                                  /*!< CRC_CTRL: TOT Position                  */
#define CRC_CTRL_TOT(x)                          (((x)<<CRC_CTRL_TOT_SHIFT)&CRC_CTRL_TOT_MASK)       /*!< CRC_CTRL                                */

/* ------- CRC_CTRLHU                               ------ */
#define CRC_CTRLHU_TCRC_MASK                     (0x01UL << CRC_CTRLHU_TCRC_SHIFT)                   /*!< CRC_CTRLHU: TCRC Mask                   */
#define CRC_CTRLHU_TCRC_SHIFT                    0                                                   /*!< CRC_CTRLHU: TCRC Position               */
#define CRC_CTRLHU_WAS_MASK                      (0x01UL << CRC_CTRLHU_WAS_SHIFT)                    /*!< CRC_CTRLHU: WAS Mask                    */
#define CRC_CTRLHU_WAS_SHIFT                     1                                                   /*!< CRC_CTRLHU: WAS Position                */
#define CRC_CTRLHU_FXOR_MASK                     (0x01UL << CRC_CTRLHU_FXOR_SHIFT)                   /*!< CRC_CTRLHU: FXOR Mask                   */
#define CRC_CTRLHU_FXOR_SHIFT                    2                                                   /*!< CRC_CTRLHU: FXOR Position               */
#define CRC_CTRLHU_TOTR_MASK                     (0x03UL << CRC_CTRLHU_TOTR_SHIFT)                   /*!< CRC_CTRLHU: TOTR Mask                   */
#define CRC_CTRLHU_TOTR_SHIFT                    4                                                   /*!< CRC_CTRLHU: TOTR Position               */
#define CRC_CTRLHU_TOTR(x)                       (((x)<<CRC_CTRLHU_TOTR_SHIFT)&CRC_CTRLHU_TOTR_MASK) /*!< CRC_CTRLHU                              */
#define CRC_CTRLHU_TOT_MASK                      (0x03UL << CRC_CTRLHU_TOT_SHIFT)                    /*!< CRC_CTRLHU: TOT Mask                    */
#define CRC_CTRLHU_TOT_SHIFT                     6                                                   /*!< CRC_CTRLHU: TOT Position                */
#define CRC_CTRLHU_TOT(x)                        (((x)<<CRC_CTRLHU_TOT_SHIFT)&CRC_CTRLHU_TOT_MASK)   /*!< CRC_CTRLHU                              */

/* -------------------------------------------------------------------------------- */
/* -----------     'CRC' Register Access macros                         ----------- */
/* -------------------------------------------------------------------------------- */

#define CRC_DATA                       (CRC->DATA)
#define CRC_DATAL                      (CRC->DATAL)
#define CRC_DATALL                     (CRC->DATALL)
#define CRC_DATALU                     (CRC->DATALU)
#define CRC_DATAH                      (CRC->DATAH)
#define CRC_DATAHL                     (CRC->DATAHL)
#define CRC_DATAHU                     (CRC->DATAHU)
#define CRC_GPOLY                      (CRC->GPOLY)
#define CRC_GPOLYL                     (CRC->GPOLYL)
#define CRC_GPOLYLL                    (CRC->GPOLYLL)
#define CRC_GPOLYLU                    (CRC->GPOLYLU)
#define CRC_GPOLYH                     (CRC->GPOLYH)
#define CRC_GPOLYHL                    (CRC->GPOLYHL)
#define CRC_GPOLYHU                    (CRC->GPOLYHU)
#define CRC_CTRL                       (CRC->CTRL)
#define CRC_CTRLHU                     (CRC->CTRLHU)

/* ================================================================================ */
/* ================           FGPIOA (file:FGPIOA_MKE)             ================ */
/* ================================================================================ */

/**
 * @brief General Purpose Input/Output
 */
typedef struct {                                /*!<       FGPIOA Structure                                             */
   __IO uint32_t  PDOR;                         /*!< 0000: Port Data Output Register                                    */
   __O  uint32_t  PSOR;                         /*!< 0004: Port Set Output Register                                     */
   __O  uint32_t  PCOR;                         /*!< 0008: Port Clear Output Register                                   */
   __O  uint32_t  PTOR;                         /*!< 000C: Port Toggle Output Register                                  */
   __I  uint32_t  PDIR;                         /*!< 0010: Port Data Input Register                                     */
   __IO uint32_t  PDDR;                         /*!< 0014: Port Data Direction Register                                 */
   __IO uint32_t  PIDR;                         /*!< 0018: Port Input Disable Register                                  */
} FGPIOA_Type;


/* -------------------------------------------------------------------------------- */
/* -----------     'FGPIOA' Position & Mask macros                      ----------- */
/* -------------------------------------------------------------------------------- */


/* ------- FGPIOA_PDOR                              ------ */
#define GPIO_PDOR_PTA_MASK                       (0xFFUL << GPIO_PDOR_PTA_SHIFT)                     /*!< FGPIOA_PDOR: PTA Mask                   */
#define GPIO_PDOR_PTA_SHIFT                      0                                                   /*!< FGPIOA_PDOR: PTA Position               */
#define GPIO_PDOR_PTA(x)                         (((x)<<GPIO_PDOR_PTA_SHIFT)&GPIO_PDOR_PTA_MASK)     /*!< FGPIOA_PDOR                             */
#define GPIO_PDOR_PTB_MASK                       (0xFFUL << GPIO_PDOR_PTB_SHIFT)                     /*!< FGPIOA_PDOR: PTB Mask                   */
#define GPIO_PDOR_PTB_SHIFT                      8                                                   /*!< FGPIOA_PDOR: PTB Position               */
#define GPIO_PDOR_PTB(x)                         (((x)<<GPIO_PDOR_PTB_SHIFT)&GPIO_PDOR_PTB_MASK)     /*!< FGPIOA_PDOR                             */
#define GPIO_PDOR_PTC_MASK                       (0xFFUL << GPIO_PDOR_PTC_SHIFT)                     /*!< FGPIOA_PDOR: PTC Mask                   */
#define GPIO_PDOR_PTC_SHIFT                      16                                                  /*!< FGPIOA_PDOR: PTC Position               */
#define GPIO_PDOR_PTC(x)                         (((x)<<GPIO_PDOR_PTC_SHIFT)&GPIO_PDOR_PTC_MASK)     /*!< FGPIOA_PDOR                             */
#define GPIO_PDOR_PTD_MASK                       (0xFFUL << GPIO_PDOR_PTD_SHIFT)                     /*!< FGPIOA_PDOR: PTD Mask                   */
#define GPIO_PDOR_PTD_SHIFT                      24                                                  /*!< FGPIOA_PDOR: PTD Position               */
#define GPIO_PDOR_PTD(x)                         (((x)<<GPIO_PDOR_PTD_SHIFT)&GPIO_PDOR_PTD_MASK)     /*!< FGPIOA_PDOR                             */

/* ------- FGPIOA_PSOR                              ------ */
#define GPIO_PSOR_PTA_MASK                       (0xFFUL << GPIO_PSOR_PTA_SHIFT)                     /*!< FGPIOA_PSOR: PTA Mask                   */
#define GPIO_PSOR_PTA_SHIFT                      0                                                   /*!< FGPIOA_PSOR: PTA Position               */
#define GPIO_PSOR_PTA(x)                         (((x)<<GPIO_PSOR_PTA_SHIFT)&GPIO_PSOR_PTA_MASK)     /*!< FGPIOA_PSOR                             */
#define GPIO_PSOR_PTB_MASK                       (0xFFUL << GPIO_PSOR_PTB_SHIFT)                     /*!< FGPIOA_PSOR: PTB Mask                   */
#define GPIO_PSOR_PTB_SHIFT                      8                                                   /*!< FGPIOA_PSOR: PTB Position               */
#define GPIO_PSOR_PTB(x)                         (((x)<<GPIO_PSOR_PTB_SHIFT)&GPIO_PSOR_PTB_MASK)     /*!< FGPIOA_PSOR                             */
#define GPIO_PSOR_PTC_MASK                       (0xFFUL << GPIO_PSOR_PTC_SHIFT)                     /*!< FGPIOA_PSOR: PTC Mask                   */
#define GPIO_PSOR_PTC_SHIFT                      16                                                  /*!< FGPIOA_PSOR: PTC Position               */
#define GPIO_PSOR_PTC(x)                         (((x)<<GPIO_PSOR_PTC_SHIFT)&GPIO_PSOR_PTC_MASK)     /*!< FGPIOA_PSOR                             */
#define GPIO_PSOR_PTD_MASK                       (0xFFUL << GPIO_PSOR_PTD_SHIFT)                     /*!< FGPIOA_PSOR: PTD Mask                   */
#define GPIO_PSOR_PTD_SHIFT                      24                                                  /*!< FGPIOA_PSOR: PTD Position               */
#define GPIO_PSOR_PTD(x)                         (((x)<<GPIO_PSOR_PTD_SHIFT)&GPIO_PSOR_PTD_MASK)     /*!< FGPIOA_PSOR                             */

/* ------- FGPIOA_PCOR                              ------ */
#define GPIO_PCOR_PTA_MASK                       (0xFFUL << GPIO_PCOR_PTA_SHIFT)                     /*!< FGPIOA_PCOR: PTA Mask                   */
#define GPIO_PCOR_PTA_SHIFT                      0                                                   /*!< FGPIOA_PCOR: PTA Position               */
#define GPIO_PCOR_PTA(x)                         (((x)<<GPIO_PCOR_PTA_SHIFT)&GPIO_PCOR_PTA_MASK)     /*!< FGPIOA_PCOR                             */
#define GPIO_PCOR_PTB_MASK                       (0xFFUL << GPIO_PCOR_PTB_SHIFT)                     /*!< FGPIOA_PCOR: PTB Mask                   */
#define GPIO_PCOR_PTB_SHIFT                      8                                                   /*!< FGPIOA_PCOR: PTB Position               */
#define GPIO_PCOR_PTB(x)                         (((x)<<GPIO_PCOR_PTB_SHIFT)&GPIO_PCOR_PTB_MASK)     /*!< FGPIOA_PCOR                             */
#define GPIO_PCOR_PTC_MASK                       (0xFFUL << GPIO_PCOR_PTC_SHIFT)                     /*!< FGPIOA_PCOR: PTC Mask                   */
#define GPIO_PCOR_PTC_SHIFT                      16                                                  /*!< FGPIOA_PCOR: PTC Position               */
#define GPIO_PCOR_PTC(x)                         (((x)<<GPIO_PCOR_PTC_SHIFT)&GPIO_PCOR_PTC_MASK)     /*!< FGPIOA_PCOR                             */
#define GPIO_PCOR_PTD_MASK                       (0xFFUL << GPIO_PCOR_PTD_SHIFT)                     /*!< FGPIOA_PCOR: PTD Mask                   */
#define GPIO_PCOR_PTD_SHIFT                      24                                                  /*!< FGPIOA_PCOR: PTD Position               */
#define GPIO_PCOR_PTD(x)                         (((x)<<GPIO_PCOR_PTD_SHIFT)&GPIO_PCOR_PTD_MASK)     /*!< FGPIOA_PCOR                             */

/* ------- FGPIOA_PTOR                              ------ */
#define GPIO_PTOR_PTA_MASK                       (0xFFUL << GPIO_PTOR_PTA_SHIFT)                     /*!< FGPIOA_PTOR: PTA Mask                   */
#define GPIO_PTOR_PTA_SHIFT                      0                                                   /*!< FGPIOA_PTOR: PTA Position               */
#define GPIO_PTOR_PTA(x)                         (((x)<<GPIO_PTOR_PTA_SHIFT)&GPIO_PTOR_PTA_MASK)     /*!< FGPIOA_PTOR                             */
#define GPIO_PTOR_PTB_MASK                       (0xFFUL << GPIO_PTOR_PTB_SHIFT)                     /*!< FGPIOA_PTOR: PTB Mask                   */
#define GPIO_PTOR_PTB_SHIFT                      8                                                   /*!< FGPIOA_PTOR: PTB Position               */
#define GPIO_PTOR_PTB(x)                         (((x)<<GPIO_PTOR_PTB_SHIFT)&GPIO_PTOR_PTB_MASK)     /*!< FGPIOA_PTOR                             */
#define GPIO_PTOR_PTC_MASK                       (0xFFUL << GPIO_PTOR_PTC_SHIFT)                     /*!< FGPIOA_PTOR: PTC Mask                   */
#define GPIO_PTOR_PTC_SHIFT                      16                                                  /*!< FGPIOA_PTOR: PTC Position               */
#define GPIO_PTOR_PTC(x)                         (((x)<<GPIO_PTOR_PTC_SHIFT)&GPIO_PTOR_PTC_MASK)     /*!< FGPIOA_PTOR                             */
#define GPIO_PTOR_PTD_MASK                       (0xFFUL << GPIO_PTOR_PTD_SHIFT)                     /*!< FGPIOA_PTOR: PTD Mask                   */
#define GPIO_PTOR_PTD_SHIFT                      24                                                  /*!< FGPIOA_PTOR: PTD Position               */
#define GPIO_PTOR_PTD(x)                         (((x)<<GPIO_PTOR_PTD_SHIFT)&GPIO_PTOR_PTD_MASK)     /*!< FGPIOA_PTOR                             */

