podonoghue/usbdm-firmware/BootloopMKE/Project_Headers/MKE02Z64M4.h
/* ------- FGPIOA_PDIR                              ------ */
#define GPIO_PDIR_PTA_MASK                       (0xFFUL << GPIO_PDIR_PTA_SHIFT)                     /*!< FGPIOA_PDIR: PTA Mask                   */
#define GPIO_PDIR_PTA_SHIFT                      0                                                   /*!< FGPIOA_PDIR: PTA Position               */
#define GPIO_PDIR_PTA(x)                         (((x)<<GPIO_PDIR_PTA_SHIFT)&GPIO_PDIR_PTA_MASK)     /*!< FGPIOA_PDIR                             */
#define GPIO_PDIR_PTB_MASK                       (0xFFUL << GPIO_PDIR_PTB_SHIFT)                     /*!< FGPIOA_PDIR: PTB Mask                   */
#define GPIO_PDIR_PTB_SHIFT                      8                                                   /*!< FGPIOA_PDIR: PTB Position               */
#define GPIO_PDIR_PTB(x)                         (((x)<<GPIO_PDIR_PTB_SHIFT)&GPIO_PDIR_PTB_MASK)     /*!< FGPIOA_PDIR                             */
#define GPIO_PDIR_PTC_MASK                       (0xFFUL << GPIO_PDIR_PTC_SHIFT)                     /*!< FGPIOA_PDIR: PTC Mask                   */
#define GPIO_PDIR_PTC_SHIFT                      16                                                  /*!< FGPIOA_PDIR: PTC Position               */
#define GPIO_PDIR_PTC(x)                         (((x)<<GPIO_PDIR_PTC_SHIFT)&GPIO_PDIR_PTC_MASK)     /*!< FGPIOA_PDIR                             */
#define GPIO_PDIR_PTD_MASK                       (0xFFUL << GPIO_PDIR_PTD_SHIFT)                     /*!< FGPIOA_PDIR: PTD Mask                   */
#define GPIO_PDIR_PTD_SHIFT                      24                                                  /*!< FGPIOA_PDIR: PTD Position               */
#define GPIO_PDIR_PTD(x)                         (((x)<<GPIO_PDIR_PTD_SHIFT)&GPIO_PDIR_PTD_MASK)     /*!< FGPIOA_PDIR                             */

/* ------- FGPIOA_PDDR                              ------ */
#define GPIO_PDDR_PTA_MASK                       (0xFFUL << GPIO_PDDR_PTA_SHIFT)                     /*!< FGPIOA_PDDR: PTA Mask                   */
#define GPIO_PDDR_PTA_SHIFT                      0                                                   /*!< FGPIOA_PDDR: PTA Position               */
#define GPIO_PDDR_PTA(x)                         (((x)<<GPIO_PDDR_PTA_SHIFT)&GPIO_PDDR_PTA_MASK)     /*!< FGPIOA_PDDR                             */
#define GPIO_PDDR_PTB_MASK                       (0xFFUL << GPIO_PDDR_PTB_SHIFT)                     /*!< FGPIOA_PDDR: PTB Mask                   */
#define GPIO_PDDR_PTB_SHIFT                      8                                                   /*!< FGPIOA_PDDR: PTB Position               */
#define GPIO_PDDR_PTB(x)                         (((x)<<GPIO_PDDR_PTB_SHIFT)&GPIO_PDDR_PTB_MASK)     /*!< FGPIOA_PDDR                             */
#define GPIO_PDDR_PTC_MASK                       (0xFFUL << GPIO_PDDR_PTC_SHIFT)                     /*!< FGPIOA_PDDR: PTC Mask                   */
#define GPIO_PDDR_PTC_SHIFT                      16                                                  /*!< FGPIOA_PDDR: PTC Position               */
#define GPIO_PDDR_PTC(x)                         (((x)<<GPIO_PDDR_PTC_SHIFT)&GPIO_PDDR_PTC_MASK)     /*!< FGPIOA_PDDR                             */
#define GPIO_PDDR_PTD_MASK                       (0xFFUL << GPIO_PDDR_PTD_SHIFT)                     /*!< FGPIOA_PDDR: PTD Mask                   */
#define GPIO_PDDR_PTD_SHIFT                      24                                                  /*!< FGPIOA_PDDR: PTD Position               */
#define GPIO_PDDR_PTD(x)                         (((x)<<GPIO_PDDR_PTD_SHIFT)&GPIO_PDDR_PTD_MASK)     /*!< FGPIOA_PDDR                             */

/* ------- FGPIOA_PIDR                              ------ */
#define GPIO_PIDR_PTA_MASK                       (0xFFUL << GPIO_PIDR_PTA_SHIFT)                     /*!< FGPIOA_PIDR: PTA Mask                   */
#define GPIO_PIDR_PTA_SHIFT                      0                                                   /*!< FGPIOA_PIDR: PTA Position               */
#define GPIO_PIDR_PTA(x)                         (((x)<<GPIO_PIDR_PTA_SHIFT)&GPIO_PIDR_PTA_MASK)     /*!< FGPIOA_PIDR                             */
#define GPIO_PIDR_PTB_MASK                       (0xFFUL << GPIO_PIDR_PTB_SHIFT)                     /*!< FGPIOA_PIDR: PTB Mask                   */
#define GPIO_PIDR_PTB_SHIFT                      8                                                   /*!< FGPIOA_PIDR: PTB Position               */
#define GPIO_PIDR_PTB(x)                         (((x)<<GPIO_PIDR_PTB_SHIFT)&GPIO_PIDR_PTB_MASK)     /*!< FGPIOA_PIDR                             */
#define GPIO_PIDR_PTC_MASK                       (0xFFUL << GPIO_PIDR_PTC_SHIFT)                     /*!< FGPIOA_PIDR: PTC Mask                   */
#define GPIO_PIDR_PTC_SHIFT                      16                                                  /*!< FGPIOA_PIDR: PTC Position               */
#define GPIO_PIDR_PTC(x)                         (((x)<<GPIO_PIDR_PTC_SHIFT)&GPIO_PIDR_PTC_MASK)     /*!< FGPIOA_PIDR                             */
#define GPIO_PIDR_PTD_MASK                       (0xFFUL << GPIO_PIDR_PTD_SHIFT)                     /*!< FGPIOA_PIDR: PTD Mask                   */
#define GPIO_PIDR_PTD_SHIFT                      24                                                  /*!< FGPIOA_PIDR: PTD Position               */
#define GPIO_PIDR_PTD(x)                         (((x)<<GPIO_PIDR_PTD_SHIFT)&GPIO_PIDR_PTD_MASK)     /*!< FGPIOA_PIDR                             */

/* -------------------------------------------------------------------------------- */
/* -----------     'FGPIOA' Register Access macros                      ----------- */
/* -------------------------------------------------------------------------------- */

#define FGPIOA_PDOR                    (FGPIOA->PDOR)
#define FGPIOA_PSOR                    (FGPIOA->PSOR)
#define FGPIOA_PCOR                    (FGPIOA->PCOR)
#define FGPIOA_PTOR                    (FGPIOA->PTOR)
#define FGPIOA_PDIR                    (FGPIOA->PDIR)
#define FGPIOA_PDDR                    (FGPIOA->PDDR)
#define FGPIOA_PIDR                    (FGPIOA->PIDR)

/* ================================================================================ */
/* ================           FGPIOB (file:FGPIOB_MKE)             ================ */
/* ================================================================================ */

/**
 * @brief General Purpose Input/Output
 */
typedef struct {                                /*!<       FGPIOB Structure                                             */
   __IO uint32_t  PDOR;                         /*!< 0000: Port Data Output Register                                    */
   __O  uint32_t  PSOR;                         /*!< 0004: Port Set Output Register                                     */
   __O  uint32_t  PCOR;                         /*!< 0008: Port Clear Output Register                                   */
   __O  uint32_t  PTOR;                         /*!< 000C: Port Toggle Output Register                                  */
   __I  uint32_t  PDIR;                         /*!< 0010: Port Data Input Register                                     */
   __IO uint32_t  PDDR;                         /*!< 0014: Port Data Direction Register                                 */
   __IO uint32_t  PIDR;                         /*!< 0018: Port Input Disable Register                                  */
} FGPIOB_Type;


/* -------------------------------------------------------------------------------- */
/* -----------     'FGPIOB' Position & Mask macros                      ----------- */
/* -------------------------------------------------------------------------------- */


