podonoghue/usbdm-firmware/BootloopMKE/Project_Headers/MKE02Z64M4.h
/* ------- FGPIOB_PDOR                              ------ */
#define GPIO_PDOR_PTE_MASK                       (0xFFUL << GPIO_PDOR_PTE_SHIFT)                     /*!< FGPIOB_PDOR: PTE Mask                   */
#define GPIO_PDOR_PTE_SHIFT                      0                                                   /*!< FGPIOB_PDOR: PTE Position               */
#define GPIO_PDOR_PTE(x)                         (((x)<<GPIO_PDOR_PTE_SHIFT)&GPIO_PDOR_PTE_MASK)     /*!< FGPIOB_PDOR                             */
#define GPIO_PDOR_PTF_MASK                       (0xFFUL << GPIO_PDOR_PTF_SHIFT)                     /*!< FGPIOB_PDOR: PTF Mask                   */
#define GPIO_PDOR_PTF_SHIFT                      8                                                   /*!< FGPIOB_PDOR: PTF Position               */
#define GPIO_PDOR_PTF(x)                         (((x)<<GPIO_PDOR_PTF_SHIFT)&GPIO_PDOR_PTF_MASK)     /*!< FGPIOB_PDOR                             */
#define GPIO_PDOR_PTG_MASK                       (0xFFUL << GPIO_PDOR_PTG_SHIFT)                     /*!< FGPIOB_PDOR: PTG Mask                   */
#define GPIO_PDOR_PTG_SHIFT                      16                                                  /*!< FGPIOB_PDOR: PTG Position               */
#define GPIO_PDOR_PTG(x)                         (((x)<<GPIO_PDOR_PTG_SHIFT)&GPIO_PDOR_PTG_MASK)     /*!< FGPIOB_PDOR                             */
#define GPIO_PDOR_PTH_MASK                       (0xFFUL << GPIO_PDOR_PTH_SHIFT)                     /*!< FGPIOB_PDOR: PTH Mask                   */
#define GPIO_PDOR_PTH_SHIFT                      24                                                  /*!< FGPIOB_PDOR: PTH Position               */
#define GPIO_PDOR_PTH(x)                         (((x)<<GPIO_PDOR_PTH_SHIFT)&GPIO_PDOR_PTH_MASK)     /*!< FGPIOB_PDOR                             */

/* ------- FGPIOB_PSOR                              ------ */
#define GPIO_PSOR_PTE_MASK                       (0xFFUL << GPIO_PSOR_PTE_SHIFT)                     /*!< FGPIOB_PSOR: PTE Mask                   */
#define GPIO_PSOR_PTE_SHIFT                      0                                                   /*!< FGPIOB_PSOR: PTE Position               */
#define GPIO_PSOR_PTE(x)                         (((x)<<GPIO_PSOR_PTE_SHIFT)&GPIO_PSOR_PTE_MASK)     /*!< FGPIOB_PSOR                             */
#define GPIO_PSOR_PTF_MASK                       (0xFFUL << GPIO_PSOR_PTF_SHIFT)                     /*!< FGPIOB_PSOR: PTF Mask                   */
#define GPIO_PSOR_PTF_SHIFT                      8                                                   /*!< FGPIOB_PSOR: PTF Position               */
#define GPIO_PSOR_PTF(x)                         (((x)<<GPIO_PSOR_PTF_SHIFT)&GPIO_PSOR_PTF_MASK)     /*!< FGPIOB_PSOR                             */
#define GPIO_PSOR_PTG_MASK                       (0xFFUL << GPIO_PSOR_PTG_SHIFT)                     /*!< FGPIOB_PSOR: PTG Mask                   */
#define GPIO_PSOR_PTG_SHIFT                      16                                                  /*!< FGPIOB_PSOR: PTG Position               */
#define GPIO_PSOR_PTG(x)                         (((x)<<GPIO_PSOR_PTG_SHIFT)&GPIO_PSOR_PTG_MASK)     /*!< FGPIOB_PSOR                             */
#define GPIO_PSOR_PTH_MASK                       (0xFFUL << GPIO_PSOR_PTH_SHIFT)                     /*!< FGPIOB_PSOR: PTH Mask                   */
#define GPIO_PSOR_PTH_SHIFT                      24                                                  /*!< FGPIOB_PSOR: PTH Position               */
#define GPIO_PSOR_PTH(x)                         (((x)<<GPIO_PSOR_PTH_SHIFT)&GPIO_PSOR_PTH_MASK)     /*!< FGPIOB_PSOR                             */

/* ------- FGPIOB_PCOR                              ------ */
#define GPIO_PCOR_PTE_MASK                       (0xFFUL << GPIO_PCOR_PTE_SHIFT)                     /*!< FGPIOB_PCOR: PTE Mask                   */
#define GPIO_PCOR_PTE_SHIFT                      0                                                   /*!< FGPIOB_PCOR: PTE Position               */
#define GPIO_PCOR_PTE(x)                         (((x)<<GPIO_PCOR_PTE_SHIFT)&GPIO_PCOR_PTE_MASK)     /*!< FGPIOB_PCOR                             */
#define GPIO_PCOR_PTF_MASK                       (0xFFUL << GPIO_PCOR_PTF_SHIFT)                     /*!< FGPIOB_PCOR: PTF Mask                   */
#define GPIO_PCOR_PTF_SHIFT                      8                                                   /*!< FGPIOB_PCOR: PTF Position               */
#define GPIO_PCOR_PTF(x)                         (((x)<<GPIO_PCOR_PTF_SHIFT)&GPIO_PCOR_PTF_MASK)     /*!< FGPIOB_PCOR                             */
#define GPIO_PCOR_PTG_MASK                       (0xFFUL << GPIO_PCOR_PTG_SHIFT)                     /*!< FGPIOB_PCOR: PTG Mask                   */
#define GPIO_PCOR_PTG_SHIFT                      16                                                  /*!< FGPIOB_PCOR: PTG Position               */
#define GPIO_PCOR_PTG(x)                         (((x)<<GPIO_PCOR_PTG_SHIFT)&GPIO_PCOR_PTG_MASK)     /*!< FGPIOB_PCOR                             */
#define GPIO_PCOR_PTH_MASK                       (0xFFUL << GPIO_PCOR_PTH_SHIFT)                     /*!< FGPIOB_PCOR: PTH Mask                   */
#define GPIO_PCOR_PTH_SHIFT                      24                                                  /*!< FGPIOB_PCOR: PTH Position               */
#define GPIO_PCOR_PTH(x)                         (((x)<<GPIO_PCOR_PTH_SHIFT)&GPIO_PCOR_PTH_MASK)     /*!< FGPIOB_PCOR                             */

/* ------- FGPIOB_PTOR                              ------ */
#define GPIO_PTOR_PTE_MASK                       (0xFFUL << GPIO_PTOR_PTE_SHIFT)                     /*!< FGPIOB_PTOR: PTE Mask                   */
#define GPIO_PTOR_PTE_SHIFT                      0                                                   /*!< FGPIOB_PTOR: PTE Position               */
#define GPIO_PTOR_PTE(x)                         (((x)<<GPIO_PTOR_PTE_SHIFT)&GPIO_PTOR_PTE_MASK)     /*!< FGPIOB_PTOR                             */
#define GPIO_PTOR_PTF_MASK                       (0xFFUL << GPIO_PTOR_PTF_SHIFT)                     /*!< FGPIOB_PTOR: PTF Mask                   */
#define GPIO_PTOR_PTF_SHIFT                      8                                                   /*!< FGPIOB_PTOR: PTF Position               */
#define GPIO_PTOR_PTF(x)                         (((x)<<GPIO_PTOR_PTF_SHIFT)&GPIO_PTOR_PTF_MASK)     /*!< FGPIOB_PTOR                             */
#define GPIO_PTOR_PTG_MASK                       (0xFFUL << GPIO_PTOR_PTG_SHIFT)                     /*!< FGPIOB_PTOR: PTG Mask                   */
#define GPIO_PTOR_PTG_SHIFT                      16                                                  /*!< FGPIOB_PTOR: PTG Position               */
#define GPIO_PTOR_PTG(x)                         (((x)<<GPIO_PTOR_PTG_SHIFT)&GPIO_PTOR_PTG_MASK)     /*!< FGPIOB_PTOR                             */
#define GPIO_PTOR_PTH_MASK                       (0xFFUL << GPIO_PTOR_PTH_SHIFT)                     /*!< FGPIOB_PTOR: PTH Mask                   */
#define GPIO_PTOR_PTH_SHIFT                      24                                                  /*!< FGPIOB_PTOR: PTH Position               */
#define GPIO_PTOR_PTH(x)                         (((x)<<GPIO_PTOR_PTH_SHIFT)&GPIO_PTOR_PTH_MASK)     /*!< FGPIOB_PTOR                             */

/* ------- FGPIOB_PDIR                              ------ */
#define GPIO_PDIR_PTE_MASK                       (0xFFUL << GPIO_PDIR_PTE_SHIFT)                     /*!< FGPIOB_PDIR: PTE Mask                   */
#define GPIO_PDIR_PTE_SHIFT                      0                                                   /*!< FGPIOB_PDIR: PTE Position               */
#define GPIO_PDIR_PTE(x)                         (((x)<<GPIO_PDIR_PTE_SHIFT)&GPIO_PDIR_PTE_MASK)     /*!< FGPIOB_PDIR                             */
#define GPIO_PDIR_PTF_MASK                       (0xFFUL << GPIO_PDIR_PTF_SHIFT)                     /*!< FGPIOB_PDIR: PTF Mask                   */
#define GPIO_PDIR_PTF_SHIFT                      8                                                   /*!< FGPIOB_PDIR: PTF Position               */
#define GPIO_PDIR_PTF(x)                         (((x)<<GPIO_PDIR_PTF_SHIFT)&GPIO_PDIR_PTF_MASK)     /*!< FGPIOB_PDIR                             */
#define GPIO_PDIR_PTG_MASK                       (0xFFUL << GPIO_PDIR_PTG_SHIFT)                     /*!< FGPIOB_PDIR: PTG Mask                   */
#define GPIO_PDIR_PTG_SHIFT                      16                                                  /*!< FGPIOB_PDIR: PTG Position               */
#define GPIO_PDIR_PTG(x)                         (((x)<<GPIO_PDIR_PTG_SHIFT)&GPIO_PDIR_PTG_MASK)     /*!< FGPIOB_PDIR                             */
#define GPIO_PDIR_PTH_MASK                       (0xFFUL << GPIO_PDIR_PTH_SHIFT)                     /*!< FGPIOB_PDIR: PTH Mask                   */
#define GPIO_PDIR_PTH_SHIFT                      24                                                  /*!< FGPIOB_PDIR: PTH Position               */
#define GPIO_PDIR_PTH(x)                         (((x)<<GPIO_PDIR_PTH_SHIFT)&GPIO_PDIR_PTH_MASK)     /*!< FGPIOB_PDIR                             */

/* ------- FGPIOB_PDDR                              ------ */
#define GPIO_PDDR_PTE_MASK                       (0xFFUL << GPIO_PDDR_PTE_SHIFT)                     /*!< FGPIOB_PDDR: PTE Mask                   */
#define GPIO_PDDR_PTE_SHIFT                      0                                                   /*!< FGPIOB_PDDR: PTE Position               */
#define GPIO_PDDR_PTE(x)                         (((x)<<GPIO_PDDR_PTE_SHIFT)&GPIO_PDDR_PTE_MASK)     /*!< FGPIOB_PDDR                             */
#define GPIO_PDDR_PTF_MASK                       (0xFFUL << GPIO_PDDR_PTF_SHIFT)                     /*!< FGPIOB_PDDR: PTF Mask                   */
#define GPIO_PDDR_PTF_SHIFT                      8                                                   /*!< FGPIOB_PDDR: PTF Position               */
#define GPIO_PDDR_PTF(x)                         (((x)<<GPIO_PDDR_PTF_SHIFT)&GPIO_PDDR_PTF_MASK)     /*!< FGPIOB_PDDR                             */
#define GPIO_PDDR_PTG_MASK                       (0xFFUL << GPIO_PDDR_PTG_SHIFT)                     /*!< FGPIOB_PDDR: PTG Mask                   */
#define GPIO_PDDR_PTG_SHIFT                      16                                                  /*!< FGPIOB_PDDR: PTG Position               */
#define GPIO_PDDR_PTG(x)                         (((x)<<GPIO_PDDR_PTG_SHIFT)&GPIO_PDDR_PTG_MASK)     /*!< FGPIOB_PDDR                             */
#define GPIO_PDDR_PTH_MASK                       (0xFFUL << GPIO_PDDR_PTH_SHIFT)                     /*!< FGPIOB_PDDR: PTH Mask                   */
#define GPIO_PDDR_PTH_SHIFT                      24                                                  /*!< FGPIOB_PDDR: PTH Position               */
#define GPIO_PDDR_PTH(x)                         (((x)<<GPIO_PDDR_PTH_SHIFT)&GPIO_PDDR_PTH_MASK)     /*!< FGPIOB_PDDR                             */

