podonoghue/usbdm-firmware/BootloopMKE/Project_Headers/MKE02Z64M4.h
/* ------- FTM2_INVCTRL                             ------ */
#define FTM_INVCTRL_INV0EN_MASK                  (0x01UL << FTM_INVCTRL_INV0EN_SHIFT)                /*!< FTM2_INVCTRL: INV0EN Mask               */
#define FTM_INVCTRL_INV0EN_SHIFT                 0                                                   /*!< FTM2_INVCTRL: INV0EN Position           */
#define FTM_INVCTRL_INV1EN_MASK                  (0x01UL << FTM_INVCTRL_INV1EN_SHIFT)                /*!< FTM2_INVCTRL: INV1EN Mask               */
#define FTM_INVCTRL_INV1EN_SHIFT                 1                                                   /*!< FTM2_INVCTRL: INV1EN Position           */
#define FTM_INVCTRL_INV2EN_MASK                  (0x01UL << FTM_INVCTRL_INV2EN_SHIFT)                /*!< FTM2_INVCTRL: INV2EN Mask               */
#define FTM_INVCTRL_INV2EN_SHIFT                 2                                                   /*!< FTM2_INVCTRL: INV2EN Position           */
#define FTM_INVCTRL_INV3EN_MASK                  (0x01UL << FTM_INVCTRL_INV3EN_SHIFT)                /*!< FTM2_INVCTRL: INV3EN Mask               */
#define FTM_INVCTRL_INV3EN_SHIFT                 3                                                   /*!< FTM2_INVCTRL: INV3EN Position           */

/* ------- FTM2_SWOCTRL                             ------ */
#define FTM_SWOCTRL_CH0OC_MASK                   (0x01UL << FTM_SWOCTRL_CH0OC_SHIFT)                 /*!< FTM2_SWOCTRL: CH0OC Mask                */
#define FTM_SWOCTRL_CH0OC_SHIFT                  0                                                   /*!< FTM2_SWOCTRL: CH0OC Position            */
#define FTM_SWOCTRL_CH1OC_MASK                   (0x01UL << FTM_SWOCTRL_CH1OC_SHIFT)                 /*!< FTM2_SWOCTRL: CH1OC Mask                */
#define FTM_SWOCTRL_CH1OC_SHIFT                  1                                                   /*!< FTM2_SWOCTRL: CH1OC Position            */
#define FTM_SWOCTRL_CH2OC_MASK                   (0x01UL << FTM_SWOCTRL_CH2OC_SHIFT)                 /*!< FTM2_SWOCTRL: CH2OC Mask                */
#define FTM_SWOCTRL_CH2OC_SHIFT                  2                                                   /*!< FTM2_SWOCTRL: CH2OC Position            */
#define FTM_SWOCTRL_CH3OC_MASK                   (0x01UL << FTM_SWOCTRL_CH3OC_SHIFT)                 /*!< FTM2_SWOCTRL: CH3OC Mask                */
#define FTM_SWOCTRL_CH3OC_SHIFT                  3                                                   /*!< FTM2_SWOCTRL: CH3OC Position            */
#define FTM_SWOCTRL_CH4OC_MASK                   (0x01UL << FTM_SWOCTRL_CH4OC_SHIFT)                 /*!< FTM2_SWOCTRL: CH4OC Mask                */
#define FTM_SWOCTRL_CH4OC_SHIFT                  4                                                   /*!< FTM2_SWOCTRL: CH4OC Position            */
#define FTM_SWOCTRL_CH5OC_MASK                   (0x01UL << FTM_SWOCTRL_CH5OC_SHIFT)                 /*!< FTM2_SWOCTRL: CH5OC Mask                */
#define FTM_SWOCTRL_CH5OC_SHIFT                  5                                                   /*!< FTM2_SWOCTRL: CH5OC Position            */
#define FTM_SWOCTRL_CH6OC_MASK                   (0x01UL << FTM_SWOCTRL_CH6OC_SHIFT)                 /*!< FTM2_SWOCTRL: CH6OC Mask                */
#define FTM_SWOCTRL_CH6OC_SHIFT                  6                                                   /*!< FTM2_SWOCTRL: CH6OC Position            */
#define FTM_SWOCTRL_CH7OC_MASK                   (0x01UL << FTM_SWOCTRL_CH7OC_SHIFT)                 /*!< FTM2_SWOCTRL: CH7OC Mask                */
#define FTM_SWOCTRL_CH7OC_SHIFT                  7                                                   /*!< FTM2_SWOCTRL: CH7OC Position            */
#define FTM_SWOCTRL_CH0OCV_MASK                  (0x01UL << FTM_SWOCTRL_CH0OCV_SHIFT)                /*!< FTM2_SWOCTRL: CH0OCV Mask               */
#define FTM_SWOCTRL_CH0OCV_SHIFT                 8                                                   /*!< FTM2_SWOCTRL: CH0OCV Position           */
#define FTM_SWOCTRL_CH1OCV_MASK                  (0x01UL << FTM_SWOCTRL_CH1OCV_SHIFT)                /*!< FTM2_SWOCTRL: CH1OCV Mask               */
#define FTM_SWOCTRL_CH1OCV_SHIFT                 9                                                   /*!< FTM2_SWOCTRL: CH1OCV Position           */
#define FTM_SWOCTRL_CH2OCV_MASK                  (0x01UL << FTM_SWOCTRL_CH2OCV_SHIFT)                /*!< FTM2_SWOCTRL: CH2OCV Mask               */
#define FTM_SWOCTRL_CH2OCV_SHIFT                 10                                                  /*!< FTM2_SWOCTRL: CH2OCV Position           */
#define FTM_SWOCTRL_CH3OCV_MASK                  (0x01UL << FTM_SWOCTRL_CH3OCV_SHIFT)                /*!< FTM2_SWOCTRL: CH3OCV Mask               */
#define FTM_SWOCTRL_CH3OCV_SHIFT                 11                                                  /*!< FTM2_SWOCTRL: CH3OCV Position           */
#define FTM_SWOCTRL_CH4OCV_MASK                  (0x01UL << FTM_SWOCTRL_CH4OCV_SHIFT)                /*!< FTM2_SWOCTRL: CH4OCV Mask               */
#define FTM_SWOCTRL_CH4OCV_SHIFT                 12                                                  /*!< FTM2_SWOCTRL: CH4OCV Position           */
#define FTM_SWOCTRL_CH5OCV_MASK                  (0x01UL << FTM_SWOCTRL_CH5OCV_SHIFT)                /*!< FTM2_SWOCTRL: CH5OCV Mask               */
#define FTM_SWOCTRL_CH5OCV_SHIFT                 13                                                  /*!< FTM2_SWOCTRL: CH5OCV Position           */
#define FTM_SWOCTRL_CH6OCV_MASK                  (0x01UL << FTM_SWOCTRL_CH6OCV_SHIFT)                /*!< FTM2_SWOCTRL: CH6OCV Mask               */
#define FTM_SWOCTRL_CH6OCV_SHIFT                 14                                                  /*!< FTM2_SWOCTRL: CH6OCV Position           */
#define FTM_SWOCTRL_CH7OCV_MASK                  (0x01UL << FTM_SWOCTRL_CH7OCV_SHIFT)                /*!< FTM2_SWOCTRL: CH7OCV Mask               */
#define FTM_SWOCTRL_CH7OCV_SHIFT                 15                                                  /*!< FTM2_SWOCTRL: CH7OCV Position           */

/* ------- FTM2_PWMLOAD                             ------ */
#define FTM_PWMLOAD_CH0SEL_MASK                  (0x01UL << FTM_PWMLOAD_CH0SEL_SHIFT)                /*!< FTM2_PWMLOAD: CH0SEL Mask               */
#define FTM_PWMLOAD_CH0SEL_SHIFT                 0                                                   /*!< FTM2_PWMLOAD: CH0SEL Position           */
#define FTM_PWMLOAD_CH1SEL_MASK                  (0x01UL << FTM_PWMLOAD_CH1SEL_SHIFT)                /*!< FTM2_PWMLOAD: CH1SEL Mask               */
#define FTM_PWMLOAD_CH1SEL_SHIFT                 1                                                   /*!< FTM2_PWMLOAD: CH1SEL Position           */
#define FTM_PWMLOAD_CH2SEL_MASK                  (0x01UL << FTM_PWMLOAD_CH2SEL_SHIFT)                /*!< FTM2_PWMLOAD: CH2SEL Mask               */
#define FTM_PWMLOAD_CH2SEL_SHIFT                 2                                                   /*!< FTM2_PWMLOAD: CH2SEL Position           */
#define FTM_PWMLOAD_CH3SEL_MASK                  (0x01UL << FTM_PWMLOAD_CH3SEL_SHIFT)                /*!< FTM2_PWMLOAD: CH3SEL Mask               */
#define FTM_PWMLOAD_CH3SEL_SHIFT                 3                                                   /*!< FTM2_PWMLOAD: CH3SEL Position           */
#define FTM_PWMLOAD_CH4SEL_MASK                  (0x01UL << FTM_PWMLOAD_CH4SEL_SHIFT)                /*!< FTM2_PWMLOAD: CH4SEL Mask               */
#define FTM_PWMLOAD_CH4SEL_SHIFT                 4                                                   /*!< FTM2_PWMLOAD: CH4SEL Position           */
#define FTM_PWMLOAD_CH5SEL_MASK                  (0x01UL << FTM_PWMLOAD_CH5SEL_SHIFT)                /*!< FTM2_PWMLOAD: CH5SEL Mask               */
#define FTM_PWMLOAD_CH5SEL_SHIFT                 5                                                   /*!< FTM2_PWMLOAD: CH5SEL Position           */
#define FTM_PWMLOAD_CH6SEL_MASK                  (0x01UL << FTM_PWMLOAD_CH6SEL_SHIFT)                /*!< FTM2_PWMLOAD: CH6SEL Mask               */
#define FTM_PWMLOAD_CH6SEL_SHIFT                 6                                                   /*!< FTM2_PWMLOAD: CH6SEL Position           */
#define FTM_PWMLOAD_CH7SEL_MASK                  (0x01UL << FTM_PWMLOAD_CH7SEL_SHIFT)                /*!< FTM2_PWMLOAD: CH7SEL Mask               */
#define FTM_PWMLOAD_CH7SEL_SHIFT                 7                                                   /*!< FTM2_PWMLOAD: CH7SEL Position           */
#define FTM_PWMLOAD_LDOK_MASK                    (0x01UL << FTM_PWMLOAD_LDOK_SHIFT)                  /*!< FTM2_PWMLOAD: LDOK Mask                 */
#define FTM_PWMLOAD_LDOK_SHIFT                   9                                                   /*!< FTM2_PWMLOAD: LDOK Position             */

/* -------------------------------------------------------------------------------- */
/* -----------     'FTM2' Register Access macros                        ----------- */
/* -------------------------------------------------------------------------------- */

#define FTM2_SC                        (FTM2->SC)
#define FTM2_CNT                       (FTM2->CNT)
#define FTM2_MOD                       (FTM2->MOD)
#define FTM2_C0SC                      (FTM2->CONTROLS[0].CnSC)
#define FTM2_C0V                       (FTM2->CONTROLS[0].CnV)
#define FTM2_C1SC                      (FTM2->CONTROLS[1].CnSC)
#define FTM2_C1V                       (FTM2->CONTROLS[1].CnV)
#define FTM2_C2SC                      (FTM2->CONTROLS[2].CnSC)
#define FTM2_C2V                       (FTM2->CONTROLS[2].CnV)
#define FTM2_C3SC                      (FTM2->CONTROLS[3].CnSC)
#define FTM2_C3V                       (FTM2->CONTROLS[3].CnV)
#define FTM2_C4SC                      (FTM2->CONTROLS[4].CnSC)
#define FTM2_C4V                       (FTM2->CONTROLS[4].CnV)
#define FTM2_C5SC                      (FTM2->CONTROLS[5].CnSC)
#define FTM2_C5V                       (FTM2->CONTROLS[5].CnV)
#define FTM2_CNTIN                     (FTM2->CNTIN)
#define FTM2_STATUS                    (FTM2->STATUS)
#define FTM2_MODE                      (FTM2->MODE)
#define FTM2_SYNC                      (FTM2->SYNC)
#define FTM2_OUTINIT                   (FTM2->OUTINIT)
#define FTM2_OUTMASK                   (FTM2->OUTMASK)
#define FTM2_COMBINE                   (FTM2->COMBINE)
#define FTM2_DEADTIME                  (FTM2->DEADTIME)
#define FTM2_EXTTRIG                   (FTM2->EXTTRIG)
#define FTM2_POL                       (FTM2->POL)
#define FTM2_FMS                       (FTM2->FMS)
#define FTM2_FILTER                    (FTM2->FILTER)
#define FTM2_FLTCTRL                   (FTM2->FLTCTRL)
#define FTM2_CONF                      (FTM2->CONF)
#define FTM2_FLTPOL                    (FTM2->FLTPOL)
#define FTM2_SYNCONF                   (FTM2->SYNCONF)
#define FTM2_INVCTRL                   (FTM2->INVCTRL)
#define FTM2_SWOCTRL                   (FTM2->SWOCTRL)
#define FTM2_PWMLOAD                   (FTM2->PWMLOAD)

/* ================================================================================ */
/* ================           FTMRH (file:FTMRH)                   ================ */
/* ================================================================================ */

/**
 * @brief Flash Memory Interface
 */
typedef struct {                                /*!<       FTMRH Structure                                              */
   __IO uint8_t   FCLKDIV;                      /*!< 0000: Flash Clock Divider Register                                 */
   __I  uint8_t   FSEC;                         /*!< 0001: Flash Security Register                                      */
   __IO uint8_t   FCCOBIX;                      /*!< 0002: Flash CCOB Index Register                                    */
   __I  uint8_t   RESERVED0;                    /*!< 0003:                                                              */
   __IO uint8_t   FCNFG;                        /*!< 0004: Flash Configuration Register                                 */
   __IO uint8_t   FERCNFG;                      /*!< 0005: Flash Error Configuration Register                           */
   __IO uint8_t   FSTAT;                        /*!< 0006: Flash Status Register                                        */
   __IO uint8_t   FERSTAT;                      /*!< 0007: Flash Error Status Register                                  */
   __IO uint8_t   FPROT;                        /*!< 0008: Flash Protection Register                                    */
   __IO uint8_t   EEPROT;                       /*!< 0009: EEPROM Protection Register                                   */
   union {                                      /*!< 0000: (size=0002)                                                  */
      __IO uint16_t  FCCOB;                     /*!< 000A: Flash Common Command Object Register (FCCOBLO:FCCOBHI)       */
      struct {                                  /*!< 0000: (size=0002)                                                  */
         __IO uint8_t   FCCOBHI;                /*!< 000A: Flash Common Command Object Register:High                    */
         __IO uint8_t   FCCOBLO;                /*!< 000B: Flash Common Command Object Register:Low                     */
      };
   };
   __I  uint8_t   FOPT;                         /*!< 000C: Flash Option Register                                        */
} FTMRH_Type;


/* -------------------------------------------------------------------------------- */
/* -----------     'FTMRH' Position & Mask macros                       ----------- */
/* -------------------------------------------------------------------------------- */


/* ------- FTMRH_FCLKDIV                            ------ */
#define FTMRH_FCLKDIV_FDIV_MASK                  (0x3FUL << FTMRH_FCLKDIV_FDIV_SHIFT)                /*!< FTMRH_FCLKDIV: FDIV Mask                */
#define FTMRH_FCLKDIV_FDIV_SHIFT                 0                                                   /*!< FTMRH_FCLKDIV: FDIV Position            */
#define FTMRH_FCLKDIV_FDIV(x)                    (((x)<<FTMRH_FCLKDIV_FDIV_SHIFT)&FTMRH_FCLKDIV_FDIV_MASK) /*!< FTMRH_FCLKDIV                           */
#define FTMRH_FCLKDIV_FDIVLCK_MASK               (0x01UL << FTMRH_FCLKDIV_FDIVLCK_SHIFT)             /*!< FTMRH_FCLKDIV: FDIVLCK Mask             */
#define FTMRH_FCLKDIV_FDIVLCK_SHIFT              6                                                   /*!< FTMRH_FCLKDIV: FDIVLCK Position         */
#define FTMRH_FCLKDIV_FDIVLD_MASK                (0x01UL << FTMRH_FCLKDIV_FDIVLD_SHIFT)              /*!< FTMRH_FCLKDIV: FDIVLD Mask              */
#define FTMRH_FCLKDIV_FDIVLD_SHIFT               7                                                   /*!< FTMRH_FCLKDIV: FDIVLD Position          */

/* ------- FTMRH_FSEC                               ------ */
#define FTMRH_FSEC_SEC_MASK                      (0x03UL << FTMRH_FSEC_SEC_SHIFT)                    /*!< FTMRH_FSEC: SEC Mask                    */
#define FTMRH_FSEC_SEC_SHIFT                     0                                                   /*!< FTMRH_FSEC: SEC Position                */
#define FTMRH_FSEC_SEC(x)                        (((x)<<FTMRH_FSEC_SEC_SHIFT)&FTMRH_FSEC_SEC_MASK)   /*!< FTMRH_FSEC                              */
#define FTMRH_FSEC_KEYEN_MASK                    (0x03UL << FTMRH_FSEC_KEYEN_SHIFT)                  /*!< FTMRH_FSEC: KEYEN Mask                  */
#define FTMRH_FSEC_KEYEN_SHIFT                   6                                                   /*!< FTMRH_FSEC: KEYEN Position              */
#define FTMRH_FSEC_KEYEN(x)                      (((x)<<FTMRH_FSEC_KEYEN_SHIFT)&FTMRH_FSEC_KEYEN_MASK) /*!< FTMRH_FSEC                              */

