podonoghue/usbdm-firmware/BootloopMKE/Project_Headers/MKE02Z64M4.h
/* ------- FTMRH_FCCOBIX                            ------ */
#define FTMRH_FCCOBIX_CCOBIX_MASK                (0x07UL << FTMRH_FCCOBIX_CCOBIX_SHIFT)              /*!< FTMRH_FCCOBIX: CCOBIX Mask              */
#define FTMRH_FCCOBIX_CCOBIX_SHIFT               0                                                   /*!< FTMRH_FCCOBIX: CCOBIX Position          */
#define FTMRH_FCCOBIX_CCOBIX(x)                  (((x)<<FTMRH_FCCOBIX_CCOBIX_SHIFT)&FTMRH_FCCOBIX_CCOBIX_MASK) /*!< FTMRH_FCCOBIX                           */

/* ------- FTMRH_FCNFG                              ------ */
#define FTMRH_FCNFG_FSFD_MASK                    (0x01UL << FTMRH_FCNFG_FSFD_SHIFT)                  /*!< FTMRH_FCNFG: FSFD Mask                  */
#define FTMRH_FCNFG_FSFD_SHIFT                   0                                                   /*!< FTMRH_FCNFG: FSFD Position              */
#define FTMRH_FCNFG_FDFD_MASK                    (0x01UL << FTMRH_FCNFG_FDFD_SHIFT)                  /*!< FTMRH_FCNFG: FDFD Mask                  */
#define FTMRH_FCNFG_FDFD_SHIFT                   1                                                   /*!< FTMRH_FCNFG: FDFD Position              */
#define FTMRH_FCNFG_IGNSF_MASK                   (0x01UL << FTMRH_FCNFG_IGNSF_SHIFT)                 /*!< FTMRH_FCNFG: IGNSF Mask                 */
#define FTMRH_FCNFG_IGNSF_SHIFT                  4                                                   /*!< FTMRH_FCNFG: IGNSF Position             */
#define FTMRH_FCNFG_CCIE_MASK                    (0x01UL << FTMRH_FCNFG_CCIE_SHIFT)                  /*!< FTMRH_FCNFG: CCIE Mask                  */
#define FTMRH_FCNFG_CCIE_SHIFT                   7                                                   /*!< FTMRH_FCNFG: CCIE Position              */

/* ------- FTMRH_FERCNFG                            ------ */
#define FTMRH_FERCNFG_SFDIE_MASK                 (0x01UL << FTMRH_FERCNFG_SFDIE_SHIFT)               /*!< FTMRH_FERCNFG: SFDIE Mask               */
#define FTMRH_FERCNFG_SFDIE_SHIFT                0                                                   /*!< FTMRH_FERCNFG: SFDIE Position           */
#define FTMRH_FERCNFG_DFDIE_MASK                 (0x01UL << FTMRH_FERCNFG_DFDIE_SHIFT)               /*!< FTMRH_FERCNFG: DFDIE Mask               */
#define FTMRH_FERCNFG_DFDIE_SHIFT                1                                                   /*!< FTMRH_FERCNFG: DFDIE Position           */

/* ------- FTMRH_FSTAT                              ------ */
#define FTMRH_FSTAT_MGSTAT_MASK                  (0x03UL << FTMRH_FSTAT_MGSTAT_SHIFT)                /*!< FTMRH_FSTAT: MGSTAT Mask                */
#define FTMRH_FSTAT_MGSTAT_SHIFT                 0                                                   /*!< FTMRH_FSTAT: MGSTAT Position            */
#define FTMRH_FSTAT_MGSTAT(x)                    (((x)<<FTMRH_FSTAT_MGSTAT_SHIFT)&FTMRH_FSTAT_MGSTAT_MASK) /*!< FTMRH_FSTAT                             */
#define FTMRH_FSTAT_MGBUSY_MASK                  (0x01UL << FTMRH_FSTAT_MGBUSY_SHIFT)                /*!< FTMRH_FSTAT: MGBUSY Mask                */
#define FTMRH_FSTAT_MGBUSY_SHIFT                 3                                                   /*!< FTMRH_FSTAT: MGBUSY Position            */
#define FTMRH_FSTAT_FPVIOL_MASK                  (0x01UL << FTMRH_FSTAT_FPVIOL_SHIFT)                /*!< FTMRH_FSTAT: FPVIOL Mask                */
#define FTMRH_FSTAT_FPVIOL_SHIFT                 4                                                   /*!< FTMRH_FSTAT: FPVIOL Position            */
#define FTMRH_FSTAT_ACCERR_MASK                  (0x01UL << FTMRH_FSTAT_ACCERR_SHIFT)                /*!< FTMRH_FSTAT: ACCERR Mask                */
#define FTMRH_FSTAT_ACCERR_SHIFT                 5                                                   /*!< FTMRH_FSTAT: ACCERR Position            */
#define FTMRH_FSTAT_CCIF_MASK                    (0x01UL << FTMRH_FSTAT_CCIF_SHIFT)                  /*!< FTMRH_FSTAT: CCIF Mask                  */
#define FTMRH_FSTAT_CCIF_SHIFT                   7                                                   /*!< FTMRH_FSTAT: CCIF Position              */

/* ------- FTMRH_FERSTAT                            ------ */
#define FTMRH_FERSTAT_SFDIF_MASK                 (0x01UL << FTMRH_FERSTAT_SFDIF_SHIFT)               /*!< FTMRH_FERSTAT: SFDIF Mask               */
#define FTMRH_FERSTAT_SFDIF_SHIFT                0                                                   /*!< FTMRH_FERSTAT: SFDIF Position           */
#define FTMRH_FERSTAT_DFDIF_MASK                 (0x01UL << FTMRH_FERSTAT_DFDIF_SHIFT)               /*!< FTMRH_FERSTAT: DFDIF Mask               */
#define FTMRH_FERSTAT_DFDIF_SHIFT                1                                                   /*!< FTMRH_FERSTAT: DFDIF Position           */

/* ------- FTMRH_FPROT                              ------ */
#define FTMRH_FPROT_FPLS_MASK                    (0x03UL << FTMRH_FPROT_FPLS_SHIFT)                  /*!< FTMRH_FPROT: FPLS Mask                  */
#define FTMRH_FPROT_FPLS_SHIFT                   0                                                   /*!< FTMRH_FPROT: FPLS Position              */
#define FTMRH_FPROT_FPLS(x)                      (((x)<<FTMRH_FPROT_FPLS_SHIFT)&FTMRH_FPROT_FPLS_MASK) /*!< FTMRH_FPROT                             */
#define FTMRH_FPROT_FPLDIS_MASK                  (0x01UL << FTMRH_FPROT_FPLDIS_SHIFT)                /*!< FTMRH_FPROT: FPLDIS Mask                */
#define FTMRH_FPROT_FPLDIS_SHIFT                 2                                                   /*!< FTMRH_FPROT: FPLDIS Position            */
#define FTMRH_FPROT_FPHS_MASK                    (0x03UL << FTMRH_FPROT_FPHS_SHIFT)                  /*!< FTMRH_FPROT: FPHS Mask                  */
#define FTMRH_FPROT_FPHS_SHIFT                   3                                                   /*!< FTMRH_FPROT: FPHS Position              */
#define FTMRH_FPROT_FPHS(x)                      (((x)<<FTMRH_FPROT_FPHS_SHIFT)&FTMRH_FPROT_FPHS_MASK) /*!< FTMRH_FPROT                             */
#define FTMRH_FPROT_FPHDIS_MASK                  (0x01UL << FTMRH_FPROT_FPHDIS_SHIFT)                /*!< FTMRH_FPROT: FPHDIS Mask                */
#define FTMRH_FPROT_FPHDIS_SHIFT                 5                                                   /*!< FTMRH_FPROT: FPHDIS Position            */
#define FTMRH_FPROT_FPOPEN_MASK                  (0x01UL << FTMRH_FPROT_FPOPEN_SHIFT)                /*!< FTMRH_FPROT: FPOPEN Mask                */
#define FTMRH_FPROT_FPOPEN_SHIFT                 7                                                   /*!< FTMRH_FPROT: FPOPEN Position            */

/* ------- FTMRH_EEPROT                             ------ */
#define FTMRH_EEPROT_DPS_MASK                    (0x07UL << FTMRH_EEPROT_DPS_SHIFT)                  /*!< FTMRH_EEPROT: DPS Mask                  */
#define FTMRH_EEPROT_DPS_SHIFT                   0                                                   /*!< FTMRH_EEPROT: DPS Position              */
#define FTMRH_EEPROT_DPS(x)                      (((x)<<FTMRH_EEPROT_DPS_SHIFT)&FTMRH_EEPROT_DPS_MASK) /*!< FTMRH_EEPROT                            */
#define FTMRH_EEPROT_DPOPEN_MASK                 (0x01UL << FTMRH_EEPROT_DPOPEN_SHIFT)               /*!< FTMRH_EEPROT: DPOPEN Mask               */
#define FTMRH_EEPROT_DPOPEN_SHIFT                7                                                   /*!< FTMRH_EEPROT: DPOPEN Position           */

/* ------- FTMRH_FCCOB                              ------ */

/* ------- FTMRH_FCCOBHI                            ------ */

/* ------- FTMRH_FCCOBLO                            ------ */

