podonoghue/usbdm-firmware/BootloopMKE/Project_Headers/MKE02Z64M4.h
/* ------- PIT_MCR                                  ------ */
#define PIT_MCR_FRZ_MASK                         (0x01UL << PIT_MCR_FRZ_SHIFT)                       /*!< PIT_MCR: FRZ Mask                       */
#define PIT_MCR_FRZ_SHIFT                        0                                                   /*!< PIT_MCR: FRZ Position                   */
#define PIT_MCR_MDIS_MASK                        (0x01UL << PIT_MCR_MDIS_SHIFT)                      /*!< PIT_MCR: MDIS Mask                      */
#define PIT_MCR_MDIS_SHIFT                       1                                                   /*!< PIT_MCR: MDIS Position                  */

/* ------- PIT_LDVAL                                ------ */
#define PIT_LDVAL_TSV_MASK                       (0xFFFFFFFFUL << PIT_LDVAL_TSV_SHIFT)               /*!< PIT_LDVAL: TSV Mask                     */
#define PIT_LDVAL_TSV_SHIFT                      0                                                   /*!< PIT_LDVAL: TSV Position                 */
#define PIT_LDVAL_TSV(x)                         (((x)<<PIT_LDVAL_TSV_SHIFT)&PIT_LDVAL_TSV_MASK)     /*!< PIT_LDVAL                               */

/* ------- PIT_CVAL                                 ------ */
#define PIT_CVAL_TVL_MASK                        (0xFFFFFFFFUL << PIT_CVAL_TVL_SHIFT)                /*!< PIT_CVAL: TVL Mask                      */
#define PIT_CVAL_TVL_SHIFT                       0                                                   /*!< PIT_CVAL: TVL Position                  */
#define PIT_CVAL_TVL(x)                          (((x)<<PIT_CVAL_TVL_SHIFT)&PIT_CVAL_TVL_MASK)       /*!< PIT_CVAL                                */

/* ------- PIT_TCTRL                                ------ */
#define PIT_TCTRL_TEN_MASK                       (0x01UL << PIT_TCTRL_TEN_SHIFT)                     /*!< PIT_TCTRL: TEN Mask                     */
#define PIT_TCTRL_TEN_SHIFT                      0                                                   /*!< PIT_TCTRL: TEN Position                 */
#define PIT_TCTRL_TIE_MASK                       (0x01UL << PIT_TCTRL_TIE_SHIFT)                     /*!< PIT_TCTRL: TIE Mask                     */
#define PIT_TCTRL_TIE_SHIFT                      1                                                   /*!< PIT_TCTRL: TIE Position                 */
#define PIT_TCTRL_CHN_MASK                       (0x01UL << PIT_TCTRL_CHN_SHIFT)                     /*!< PIT_TCTRL: CHN Mask                     */
#define PIT_TCTRL_CHN_SHIFT                      2                                                   /*!< PIT_TCTRL: CHN Position                 */

/* ------- PIT_TFLG                                 ------ */
#define PIT_TFLG_TIF_MASK                        (0x01UL << PIT_TFLG_TIF_SHIFT)                      /*!< PIT_TFLG: TIF Mask                      */
#define PIT_TFLG_TIF_SHIFT                       0                                                   /*!< PIT_TFLG: TIF Position                  */

/* -------------------------------------------------------------------------------- */
/* -----------     'PIT' Register Access macros                         ----------- */
/* -------------------------------------------------------------------------------- */

#define PIT_MCR                        (PIT->MCR)
#define PIT_LDVAL0                     (PIT->CS[0].LDVAL)
#define PIT_CVAL0                      (PIT->CS[0].CVAL)
#define PIT_TCTRL0                     (PIT->CS[0].TCTRL)
#define PIT_TFLG0                      (PIT->CS[0].TFLG)
#define PIT_LDVAL1                     (PIT->CS[1].LDVAL)
#define PIT_CVAL1                      (PIT->CS[1].CVAL)
#define PIT_TCTRL1                     (PIT->CS[1].TCTRL)
#define PIT_TFLG1                      (PIT->CS[1].TFLG)

/* ================================================================================ */
/* ================           PMC (file:PMC_MKE)                   ================ */
/* ================================================================================ */

/**
 * @brief Power Management Controller
 */
typedef struct {                                /*!<       PMC Structure                                                */
   __IO uint8_t   SPMSC1;                       /*!< 0000: Low Voltage Detect Status and Control 1 Register             */
   __IO uint8_t   SPMSC2;                       /*!< 0001: System Power Management Status and Control 2 Register        */
} PMC_Type;


/* -------------------------------------------------------------------------------- */
/* -----------     'PMC' Position & Mask macros                         ----------- */
/* -------------------------------------------------------------------------------- */


/* ------- PMC_SPMSC1                               ------ */
#define PMC_SPMSC1_BGBE_MASK                     (0x01UL << PMC_SPMSC1_BGBE_SHIFT)                   /*!< PMC_SPMSC1: BGBE Mask                   */
#define PMC_SPMSC1_BGBE_SHIFT                    0                                                   /*!< PMC_SPMSC1: BGBE Position               */
#define PMC_SPMSC1_LVDE_MASK                     (0x01UL << PMC_SPMSC1_LVDE_SHIFT)                   /*!< PMC_SPMSC1: LVDE Mask                   */
#define PMC_SPMSC1_LVDE_SHIFT                    2                                                   /*!< PMC_SPMSC1: LVDE Position               */
#define PMC_SPMSC1_LVDSE_MASK                    (0x01UL << PMC_SPMSC1_LVDSE_SHIFT)                  /*!< PMC_SPMSC1: LVDSE Mask                  */
#define PMC_SPMSC1_LVDSE_SHIFT                   3                                                   /*!< PMC_SPMSC1: LVDSE Position              */
#define PMC_SPMSC1_LVDRE_MASK                    (0x01UL << PMC_SPMSC1_LVDRE_SHIFT)                  /*!< PMC_SPMSC1: LVDRE Mask                  */
#define PMC_SPMSC1_LVDRE_SHIFT                   4                                                   /*!< PMC_SPMSC1: LVDRE Position              */
#define PMC_SPMSC1_LVWIE_MASK                    (0x01UL << PMC_SPMSC1_LVWIE_SHIFT)                  /*!< PMC_SPMSC1: LVWIE Mask                  */
#define PMC_SPMSC1_LVWIE_SHIFT                   5                                                   /*!< PMC_SPMSC1: LVWIE Position              */
#define PMC_SPMSC1_LVWACK_MASK                   (0x01UL << PMC_SPMSC1_LVWACK_SHIFT)                 /*!< PMC_SPMSC1: LVWACK Mask                 */
#define PMC_SPMSC1_LVWACK_SHIFT                  6                                                   /*!< PMC_SPMSC1: LVWACK Position             */
#define PMC_SPMSC1_LVWF_MASK                     (0x01UL << PMC_SPMSC1_LVWF_SHIFT)                   /*!< PMC_SPMSC1: LVWF Mask                   */
#define PMC_SPMSC1_LVWF_SHIFT                    7                                                   /*!< PMC_SPMSC1: LVWF Position               */

/* ------- PMC_SPMSC2                               ------ */
#define PMC_SPMSC2_LVWV_MASK                     (0x03UL << PMC_SPMSC2_LVWV_SHIFT)                   /*!< PMC_SPMSC2: LVWV Mask                   */
#define PMC_SPMSC2_LVWV_SHIFT                    4                                                   /*!< PMC_SPMSC2: LVWV Position               */
#define PMC_SPMSC2_LVWV(x)                       (((x)<<PMC_SPMSC2_LVWV_SHIFT)&PMC_SPMSC2_LVWV_MASK) /*!< PMC_SPMSC2                              */
#define PMC_SPMSC2_LVDV_MASK                     (0x01UL << PMC_SPMSC2_LVDV_SHIFT)                   /*!< PMC_SPMSC2: LVDV Mask                   */
#define PMC_SPMSC2_LVDV_SHIFT                    6                                                   /*!< PMC_SPMSC2: LVDV Position               */

/* -------------------------------------------------------------------------------- */
/* -----------     'PMC' Register Access macros                         ----------- */
/* -------------------------------------------------------------------------------- */

#define PMC_SPMSC1                     (PMC->SPMSC1)
#define PMC_SPMSC2                     (PMC->SPMSC2)

/* ================================================================================ */
/* ================           PORT (file:PORT_MKE)                 ================ */
/* ================================================================================ */

/**
 * @brief Port control
 */
typedef struct {                                /*!<       PORT Structure                                               */
   __IO uint32_t  IOFLT;                        /*!< 0000: Port Filter Register                                         */
   __IO uint32_t  PUEL;                         /*!< 0004: Port Pull-up Enable Low Register                             */
   __IO uint32_t  PUEH;                         /*!< 0008: Port Pull-up Enable High Register                            */
   __IO uint32_t  HDRVE;                        /*!< 000C: Port High Drive Enable Register                              */
} PORT_Type;


/* -------------------------------------------------------------------------------- */
/* -----------     'PORT' Position & Mask macros                        ----------- */
/* -------------------------------------------------------------------------------- */


/* ------- PORT_IOFLT                               ------ */
#define PORT_IOFLT_FLTA_MASK                     (0x03UL << PORT_IOFLT_FLTA_SHIFT)                   /*!< PORT_IOFLT: FLTA Mask                   */
#define PORT_IOFLT_FLTA_SHIFT                    0                                                   /*!< PORT_IOFLT: FLTA Position               */
#define PORT_IOFLT_FLTA(x)                       (((x)<<PORT_IOFLT_FLTA_SHIFT)&PORT_IOFLT_FLTA_MASK) /*!< PORT_IOFLT                              */
#define PORT_IOFLT_FLTB_MASK                     (0x03UL << PORT_IOFLT_FLTB_SHIFT)                   /*!< PORT_IOFLT: FLTB Mask                   */
#define PORT_IOFLT_FLTB_SHIFT                    2                                                   /*!< PORT_IOFLT: FLTB Position               */
#define PORT_IOFLT_FLTB(x)                       (((x)<<PORT_IOFLT_FLTB_SHIFT)&PORT_IOFLT_FLTB_MASK) /*!< PORT_IOFLT                              */
#define PORT_IOFLT_FLTC_MASK                     (0x03UL << PORT_IOFLT_FLTC_SHIFT)                   /*!< PORT_IOFLT: FLTC Mask                   */
#define PORT_IOFLT_FLTC_SHIFT                    4                                                   /*!< PORT_IOFLT: FLTC Position               */
#define PORT_IOFLT_FLTC(x)                       (((x)<<PORT_IOFLT_FLTC_SHIFT)&PORT_IOFLT_FLTC_MASK) /*!< PORT_IOFLT                              */
#define PORT_IOFLT_FLTD_MASK                     (0x03UL << PORT_IOFLT_FLTD_SHIFT)                   /*!< PORT_IOFLT: FLTD Mask                   */
#define PORT_IOFLT_FLTD_SHIFT                    6                                                   /*!< PORT_IOFLT: FLTD Position               */
#define PORT_IOFLT_FLTD(x)                       (((x)<<PORT_IOFLT_FLTD_SHIFT)&PORT_IOFLT_FLTD_MASK) /*!< PORT_IOFLT                              */
#define PORT_IOFLT_FLTE_MASK                     (0x03UL << PORT_IOFLT_FLTE_SHIFT)                   /*!< PORT_IOFLT: FLTE Mask                   */
#define PORT_IOFLT_FLTE_SHIFT                    8                                                   /*!< PORT_IOFLT: FLTE Position               */
#define PORT_IOFLT_FLTE(x)                       (((x)<<PORT_IOFLT_FLTE_SHIFT)&PORT_IOFLT_FLTE_MASK) /*!< PORT_IOFLT                              */
#define PORT_IOFLT_FLTF_MASK                     (0x03UL << PORT_IOFLT_FLTF_SHIFT)                   /*!< PORT_IOFLT: FLTF Mask                   */
#define PORT_IOFLT_FLTF_SHIFT                    10                                                  /*!< PORT_IOFLT: FLTF Position               */
#define PORT_IOFLT_FLTF(x)                       (((x)<<PORT_IOFLT_FLTF_SHIFT)&PORT_IOFLT_FLTF_MASK) /*!< PORT_IOFLT                              */
#define PORT_IOFLT_FLTG_MASK                     (0x03UL << PORT_IOFLT_FLTG_SHIFT)                   /*!< PORT_IOFLT: FLTG Mask                   */
#define PORT_IOFLT_FLTG_SHIFT                    12                                                  /*!< PORT_IOFLT: FLTG Position               */
#define PORT_IOFLT_FLTG(x)                       (((x)<<PORT_IOFLT_FLTG_SHIFT)&PORT_IOFLT_FLTG_MASK) /*!< PORT_IOFLT                              */
#define PORT_IOFLT_FLTH_MASK                     (0x03UL << PORT_IOFLT_FLTH_SHIFT)                   /*!< PORT_IOFLT: FLTH Mask                   */
#define PORT_IOFLT_FLTH_SHIFT                    14                                                  /*!< PORT_IOFLT: FLTH Position               */
#define PORT_IOFLT_FLTH(x)                       (((x)<<PORT_IOFLT_FLTH_SHIFT)&PORT_IOFLT_FLTH_MASK) /*!< PORT_IOFLT                              */
#define PORT_IOFLT_FLTRST_MASK                   (0x03UL << PORT_IOFLT_FLTRST_SHIFT)                 /*!< PORT_IOFLT: FLTRST Mask                 */
#define PORT_IOFLT_FLTRST_SHIFT                  16                                                  /*!< PORT_IOFLT: FLTRST Position             */
#define PORT_IOFLT_FLTRST(x)                     (((x)<<PORT_IOFLT_FLTRST_SHIFT)&PORT_IOFLT_FLTRST_MASK) /*!< PORT_IOFLT                              */
#define PORT_IOFLT_FLTKBI0_MASK                  (0x03UL << PORT_IOFLT_FLTKBI0_SHIFT)                /*!< PORT_IOFLT: FLTKBI0 Mask                */
#define PORT_IOFLT_FLTKBI0_SHIFT                 18                                                  /*!< PORT_IOFLT: FLTKBI0 Position            */
#define PORT_IOFLT_FLTKBI0(x)                    (((x)<<PORT_IOFLT_FLTKBI0_SHIFT)&PORT_IOFLT_FLTKBI0_MASK) /*!< PORT_IOFLT                              */
#define PORT_IOFLT_FLTKBI1_MASK                  (0x03UL << PORT_IOFLT_FLTKBI1_SHIFT)                /*!< PORT_IOFLT: FLTKBI1 Mask                */
#define PORT_IOFLT_FLTKBI1_SHIFT                 20                                                  /*!< PORT_IOFLT: FLTKBI1 Position            */
#define PORT_IOFLT_FLTKBI1(x)                    (((x)<<PORT_IOFLT_FLTKBI1_SHIFT)&PORT_IOFLT_FLTKBI1_MASK) /*!< PORT_IOFLT                              */
#define PORT_IOFLT_FLTNMI_MASK                   (0x03UL << PORT_IOFLT_FLTNMI_SHIFT)                 /*!< PORT_IOFLT: FLTNMI Mask                 */
#define PORT_IOFLT_FLTNMI_SHIFT                  22                                                  /*!< PORT_IOFLT: FLTNMI Position             */
#define PORT_IOFLT_FLTNMI(x)                     (((x)<<PORT_IOFLT_FLTNMI_SHIFT)&PORT_IOFLT_FLTNMI_MASK) /*!< PORT_IOFLT                              */
#define PORT_IOFLT_FLTDIV1_MASK                  (0x03UL << PORT_IOFLT_FLTDIV1_SHIFT)                /*!< PORT_IOFLT: FLTDIV1 Mask                */
#define PORT_IOFLT_FLTDIV1_SHIFT                 24                                                  /*!< PORT_IOFLT: FLTDIV1 Position            */
#define PORT_IOFLT_FLTDIV1(x)                    (((x)<<PORT_IOFLT_FLTDIV1_SHIFT)&PORT_IOFLT_FLTDIV1_MASK) /*!< PORT_IOFLT                              */
#define PORT_IOFLT_FLTDIV2_MASK                  (0x07UL << PORT_IOFLT_FLTDIV2_SHIFT)                /*!< PORT_IOFLT: FLTDIV2 Mask                */
#define PORT_IOFLT_FLTDIV2_SHIFT                 26                                                  /*!< PORT_IOFLT: FLTDIV2 Position            */
#define PORT_IOFLT_FLTDIV2(x)                    (((x)<<PORT_IOFLT_FLTDIV2_SHIFT)&PORT_IOFLT_FLTDIV2_MASK) /*!< PORT_IOFLT                              */
#define PORT_IOFLT_FLTDIV3_MASK                  (0x07UL << PORT_IOFLT_FLTDIV3_SHIFT)                /*!< PORT_IOFLT: FLTDIV3 Mask                */
#define PORT_IOFLT_FLTDIV3_SHIFT                 29                                                  /*!< PORT_IOFLT: FLTDIV3 Position            */
#define PORT_IOFLT_FLTDIV3(x)                    (((x)<<PORT_IOFLT_FLTDIV3_SHIFT)&PORT_IOFLT_FLTDIV3_MASK) /*!< PORT_IOFLT                              */

/* ------- PORT_PUEL                                ------ */
#define PORT_PUEL_PTAPE_MASK                     (0xFFUL << PORT_PUEL_PTAPE_SHIFT)                   /*!< PORT_PUEL: PTAPE Mask                   */
#define PORT_PUEL_PTAPE_SHIFT                    0                                                   /*!< PORT_PUEL: PTAPE Position               */
#define PORT_PUEL_PTAPE(x)                       (((x)<<PORT_PUEL_PTAPE_SHIFT)&PORT_PUEL_PTAPE_MASK) /*!< PORT_PUEL                               */
#define PORT_PUEL_PTBPE_MASK                     (0xFFUL << PORT_PUEL_PTBPE_SHIFT)                   /*!< PORT_PUEL: PTBPE Mask                   */
#define PORT_PUEL_PTBPE_SHIFT                    8                                                   /*!< PORT_PUEL: PTBPE Position               */
#define PORT_PUEL_PTBPE(x)                       (((x)<<PORT_PUEL_PTBPE_SHIFT)&PORT_PUEL_PTBPE_MASK) /*!< PORT_PUEL                               */
#define PORT_PUEL_PTCPE_MASK                     (0xFFUL << PORT_PUEL_PTCPE_SHIFT)                   /*!< PORT_PUEL: PTCPE Mask                   */
#define PORT_PUEL_PTCPE_SHIFT                    16                                                  /*!< PORT_PUEL: PTCPE Position               */
#define PORT_PUEL_PTCPE(x)                       (((x)<<PORT_PUEL_PTCPE_SHIFT)&PORT_PUEL_PTCPE_MASK) /*!< PORT_PUEL                               */
#define PORT_PUEL_PTDPE_MASK                     (0xFFUL << PORT_PUEL_PTDPE_SHIFT)                   /*!< PORT_PUEL: PTDPE Mask                   */
#define PORT_PUEL_PTDPE_SHIFT                    24                                                  /*!< PORT_PUEL: PTDPE Position               */
#define PORT_PUEL_PTDPE(x)                       (((x)<<PORT_PUEL_PTDPE_SHIFT)&PORT_PUEL_PTDPE_MASK) /*!< PORT_PUEL                               */

/* ------- PORT_PUEH                                ------ */
#define PORT_PUEH_PTEPE_MASK                     (0xFFUL << PORT_PUEH_PTEPE_SHIFT)                   /*!< PORT_PUEH: PTEPE Mask                   */
#define PORT_PUEH_PTEPE_SHIFT                    0                                                   /*!< PORT_PUEH: PTEPE Position               */
#define PORT_PUEH_PTEPE(x)                       (((x)<<PORT_PUEH_PTEPE_SHIFT)&PORT_PUEH_PTEPE_MASK) /*!< PORT_PUEH                               */
#define PORT_PUEH_PTFPE_MASK                     (0xFFUL << PORT_PUEH_PTFPE_SHIFT)                   /*!< PORT_PUEH: PTFPE Mask                   */
#define PORT_PUEH_PTFPE_SHIFT                    8                                                   /*!< PORT_PUEH: PTFPE Position               */
#define PORT_PUEH_PTFPE(x)                       (((x)<<PORT_PUEH_PTFPE_SHIFT)&PORT_PUEH_PTFPE_MASK) /*!< PORT_PUEH                               */
#define PORT_PUEH_PTGPE_MASK                     (0xFFUL << PORT_PUEH_PTGPE_SHIFT)                   /*!< PORT_PUEH: PTGPE Mask                   */
#define PORT_PUEH_PTGPE_SHIFT                    16                                                  /*!< PORT_PUEH: PTGPE Position               */
#define PORT_PUEH_PTGPE(x)                       (((x)<<PORT_PUEH_PTGPE_SHIFT)&PORT_PUEH_PTGPE_MASK) /*!< PORT_PUEH                               */
#define PORT_PUEH_PTHPE_MASK                     (0xFFUL << PORT_PUEH_PTHPE_SHIFT)                   /*!< PORT_PUEH: PTHPE Mask                   */
#define PORT_PUEH_PTHPE_SHIFT                    24                                                  /*!< PORT_PUEH: PTHPE Position               */
#define PORT_PUEH_PTHPE(x)                       (((x)<<PORT_PUEH_PTHPE_SHIFT)&PORT_PUEH_PTHPE_MASK) /*!< PORT_PUEH                               */

/* ------- PORT_HDRVE                               ------ */
#define PORT_HDRVE_PTB4_MASK                     (0x01UL << PORT_HDRVE_PTB4_SHIFT)                   /*!< PORT_HDRVE: PTB4 Mask                   */
#define PORT_HDRVE_PTB4_SHIFT                    0                                                   /*!< PORT_HDRVE: PTB4 Position               */
#define PORT_HDRVE_PTB5_MASK                     (0x01UL << PORT_HDRVE_PTB5_SHIFT)                   /*!< PORT_HDRVE: PTB5 Mask                   */
#define PORT_HDRVE_PTB5_SHIFT                    1                                                   /*!< PORT_HDRVE: PTB5 Position               */
#define PORT_HDRVE_PTD0_MASK                     (0x01UL << PORT_HDRVE_PTD0_SHIFT)                   /*!< PORT_HDRVE: PTD0 Mask                   */
#define PORT_HDRVE_PTD0_SHIFT                    2                                                   /*!< PORT_HDRVE: PTD0 Position               */
#define PORT_HDRVE_PTD1_MASK                     (0x01UL << PORT_HDRVE_PTD1_SHIFT)                   /*!< PORT_HDRVE: PTD1 Mask                   */
#define PORT_HDRVE_PTD1_SHIFT                    3                                                   /*!< PORT_HDRVE: PTD1 Position               */
#define PORT_HDRVE_PTE0_MASK                     (0x01UL << PORT_HDRVE_PTE0_SHIFT)                   /*!< PORT_HDRVE: PTE0 Mask                   */
#define PORT_HDRVE_PTE0_SHIFT                    4                                                   /*!< PORT_HDRVE: PTE0 Position               */
#define PORT_HDRVE_PTE1_MASK                     (0x01UL << PORT_HDRVE_PTE1_SHIFT)                   /*!< PORT_HDRVE: PTE1 Mask                   */
#define PORT_HDRVE_PTE1_SHIFT                    5                                                   /*!< PORT_HDRVE: PTE1 Position               */
#define PORT_HDRVE_PTH0_MASK                     (0x01UL << PORT_HDRVE_PTH0_SHIFT)                   /*!< PORT_HDRVE: PTH0 Mask                   */
#define PORT_HDRVE_PTH0_SHIFT                    6                                                   /*!< PORT_HDRVE: PTH0 Position               */
#define PORT_HDRVE_PTH1_MASK                     (0x01UL << PORT_HDRVE_PTH1_SHIFT)                   /*!< PORT_HDRVE: PTH1 Mask                   */
#define PORT_HDRVE_PTH1_SHIFT                    7                                                   /*!< PORT_HDRVE: PTH1 Position               */

/* -------------------------------------------------------------------------------- */
/* -----------     'PORT' Register Access macros                        ----------- */
/* -------------------------------------------------------------------------------- */

#define PORT_IOFLT                     (PORT->IOFLT)
#define PORT_PUEL                      (PORT->PUEL)
#define PORT_PUEH                      (PORT->PUEH)
#define PORT_HDRVE                     (PORT->HDRVE)

/* ================================================================================ */
/* ================           RTC (file:RTC_MKE)                   ================ */
/* ================================================================================ */

/**
 * @brief Real-time counter
 */
typedef struct {                                /*!<       RTC Structure                                                */
   __IO uint32_t  SC;                           /*!< 0000: Status and Control Register                                  */
   __IO uint32_t  MOD;                          /*!< 0004: Modulo Register: Contains the modulo value used to reset the count to 0x0000 upon a compare match and set SC[RTIF] status field */
   __I  uint32_t  CNT;                          /*!< 0008: Counter Register: Reset or writing different values to SC[RTCLKS] and SC[RTCPS] clear the count to 0x0000 */
} RTC_Type;


/* -------------------------------------------------------------------------------- */
/* -----------     'RTC' Position & Mask macros                         ----------- */
/* -------------------------------------------------------------------------------- */


