podonoghue/usbdm-firmware/BootloopMKE/Project_Headers/MKE02Z64M4.h
/* ------- WDOG_TOVALL                              ------ */

/* ------- WDOG_WIN                                 ------ */

/* ------- WDOG_WINH                                ------ */

/* ------- WDOG_WINL                                ------ */

/* -------------------------------------------------------------------------------- */
/* -----------     'WDOG' Register Access macros                        ----------- */
/* -------------------------------------------------------------------------------- */

#define WDOG_CS1                       (WDOG->CS1)
#define WDOG_CS2                       (WDOG->CS2)
#define WDOG_CNT                       (WDOG->CNT)
#define WDOG_CNTH                      (WDOG->CNTH)
#define WDOG_CNTL                      (WDOG->CNTL)
#define WDOG_TOVAL                     (WDOG->TOVAL)
#define WDOG_TOVALH                    (WDOG->TOVALH)
#define WDOG_TOVALL                    (WDOG->TOVALL)
#define WDOG_WIN                       (WDOG->WIN)
#define WDOG_WINH                      (WDOG->WINH)
#define WDOG_WINL                      (WDOG->WINL)
/* --------------------  End of section using anonymous unions  ------------------- */
#if defined(__CC_ARM)
  #pragma pop
#elif defined(__ICCARM__)
  /* leave anonymous unions enabled */
#elif defined(__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined(__TMS470__)
  /* anonymous unions are enabled by default */
#elif defined(__TASKING__)
  #pragma warning restore
#else
  #warning Not supported compiler type
#endif

/* ================================================================================ */
/* ================              Peripheral memory map             ================ */
/* ================================================================================ */

#define ACMP0_BASE_PTR                 0x40073000UL
#define ACMP1_BASE_PTR                 0x40074000UL
#define ADC_BASE_PTR                   0x4003B000UL
#define BP_BASE_PTR                    0xE0002000UL
#define CRC_BASE_PTR                   0x40032000UL
#define FGPIOA_BASE_PTR                0xF8000000UL
#define FGPIOB_BASE_PTR                0xF8000000UL
#define FTM0_BASE_PTR                  0x40038000UL
#define FTM1_BASE_PTR                  0x40039000UL
#define FTM2_BASE_PTR                  0x4003A000UL
#define FTMRH_BASE_PTR                 0x40020000UL
#define GPIOA_BASE_PTR                 0x400FF000UL
#define GPIOB_BASE_PTR                 0x400FF040UL
#define I2C0_BASE_PTR                  0x40066000UL
#define ICS_BASE_PTR                   0x40064000UL
#define IRQ_BASE_PTR                   0x40031000UL
#define KBI0_BASE_PTR                  0x40079000UL
#define KBI1_BASE_PTR                  0x4007A000UL
#define MCM_BASE_PTR                   0xF0003000UL
#define NV_BASE_PTR                    0x00000400UL
#define OSC_BASE_PTR                   0x40065000UL
#define PIT_BASE_PTR                   0x40037000UL
#define PMC_BASE_PTR                   0x4007D000UL
#define PORT_BASE_PTR                  0x40049000UL
#define RTC_BASE_PTR                   0x4003D000UL
#define SIM_BASE_PTR                   0x40048000UL
#define SPI0_BASE_PTR                  0x40076000UL
#define SPI1_BASE_PTR                  0x40077000UL
#define SYST_BASE_PTR                  0xE000E010UL
#define UART0_BASE_PTR                 0x4006A000UL
#define UART1_BASE_PTR                 0x4006B000UL
#define UART2_BASE_PTR                 0x4006C000UL
#define WDOG_BASE_PTR                  0x40052000UL

/* ================================================================================ */
/* ================             Peripheral declarations            ================ */
/* ================================================================================ */

#define ACMP0                          ((volatile ACMP0_Type  *) ACMP0_BASE_PTR)
#define ACMP1                          ((volatile ACMP1_Type  *) ACMP1_BASE_PTR)
#define ADC                            ((volatile ADC_Type    *) ADC_BASE_PTR)
#define BP                             ((volatile BP_Type     *) BP_BASE_PTR)
#define CRC                            ((volatile CRC_Type    *) CRC_BASE_PTR)
#define FGPIOA                         ((volatile FGPIOA_Type *) FGPIOA_BASE_PTR)
#define FGPIOB                         ((volatile FGPIOB_Type *) FGPIOB_BASE_PTR)
#define FTM0                           ((volatile FTM0_Type   *) FTM0_BASE_PTR)
#define FTM1                           ((volatile FTM1_Type   *) FTM1_BASE_PTR)
#define FTM2                           ((volatile FTM2_Type   *) FTM2_BASE_PTR)
#define FTMRH                          ((volatile FTMRH_Type  *) FTMRH_BASE_PTR)
#define GPIOA                          ((volatile GPIOA_Type  *) GPIOA_BASE_PTR)
#define GPIOB                          ((volatile GPIOB_Type  *) GPIOB_BASE_PTR)
#define I2C0                           ((volatile I2C0_Type   *) I2C0_BASE_PTR)
#define ICS                            ((volatile ICS_Type    *) ICS_BASE_PTR)
#define IRQ                            ((volatile IRQ_Type    *) IRQ_BASE_PTR)
#define KBI0                           ((volatile KBI0_Type   *) KBI0_BASE_PTR)
#define KBI1                           ((volatile KBI1_Type   *) KBI1_BASE_PTR)
#define MCM                            ((volatile MCM_Type    *) MCM_BASE_PTR)
#define NV                             ((volatile NV_Type     *) NV_BASE_PTR)
#define OSC                            ((volatile OSC_Type    *) OSC_BASE_PTR)
#define PIT                            ((volatile PIT_Type    *) PIT_BASE_PTR)
#define PMC                            ((volatile PMC_Type    *) PMC_BASE_PTR)
#define PORT                           ((volatile PORT_Type   *) PORT_BASE_PTR)
#define RTC                            ((volatile RTC_Type    *) RTC_BASE_PTR)
#define SIM                            ((volatile SIM_Type    *) SIM_BASE_PTR)
#define SPI0                           ((volatile SPI0_Type   *) SPI0_BASE_PTR)
#define SPI1                           ((volatile SPI1_Type   *) SPI1_BASE_PTR)
#define SYST                           ((volatile SYST_Type   *) SYST_BASE_PTR)
#define UART0                          ((volatile UART0_Type  *) UART0_BASE_PTR)
#define UART1                          ((volatile UART1_Type  *) UART1_BASE_PTR)
#define UART2                          ((volatile UART2_Type  *) UART2_BASE_PTR)
#define WDOG                           ((volatile WDOG_Type   *) WDOG_BASE_PTR)

#ifdef __cplusplus
}
#endif


#endif  /* MCU_MKE02Z4 */

